[Killed] BooleanLiteral
src/VariantDevToolbar.tsx:35:40
  */
 export function VariantDevToolbar() {
   const ctx = useVariantContext();
-  const [isOpen, setIsOpen] = useState(false);
+  const [isOpen, setIsOpen] = useState(true);
   // Detect overlay synchronously on first render (for cases where both mount together).
   const [overlayDetected, setOverlayDetected] = useState(() => isOverlayPresent());
statusReason: Unable to find an accessible element with the role "dialog" and name `/Variant dev toolbar/`

Here are the accessible roles:

  button:

  Name "Toggle variant dev toolbar":
  <button

[Killed] BooleanLiteral
src/VariantDevToolbar.tsx:120:7
 
   const scopeEntries = Object.entries(ctx.scopes);
 
-  if (!ctx.uiVisible && !isOpen) return null;
+  if (ctx.uiVisible && !isOpen) return null;
 
   return (
statusReason: Unable to find an accessible element with the role "button" and name `/Toggle variant dev toolbar/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />

[Killed] ConditionalExpression
src/VariantDevToolbar.tsx:120:7
 
   const scopeEntries = Object.entries(ctx.scopes);
 
-  if (!ctx.uiVisible && !isOpen) return null;
+  if (true) return null;
 
   return (
statusReason: Unable to find an accessible element with the role "button" and name `/Toggle variant dev toolbar/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />

[Killed] BooleanLiteral
src/VariantDevToolbar.tsx:129:43
         <button
           aria-label="Toggle variant dev toolbar"
           aria-expanded={isOpen}
-          onClick={() => setIsOpen((p) => !p)}
+          onClick={() => setIsOpen((p) => p)}
           style={{
             position: "fixed",
statusReason: Unable to find an accessible element with the role "dialog" and name `/Variant dev toolbar/`

Here are the accessible roles:

  button:

  Name "Toggle variant dev toolbar":
  <button

[Killed] ArrowFunction
src/VariantDevToolbar.tsx:129:20
         <button
           aria-label="Toggle variant dev toolbar"
           aria-expanded={isOpen}
-          onClick={() => setIsOpen((p) => !p)}
+          onClick={() => undefined}
           style={{
             position: "fixed",
statusReason: Unable to find an accessible element with the role "dialog" and name `/Variant dev toolbar/`

Here are the accessible roles:

  button:

  Name "Toggle variant dev toolbar":
  <button

[Survived] StringLiteral
src/VariantDevToolbar.tsx:141:21
             background: "#6366f1",
             color: "#fff",
             border: "none",
-            cursor: "pointer",
+            cursor: "",
             display: "flex",
             alignItems: "center",

[Survived] StringLiteral
src/VariantDevToolbar.tsx:142:22
             color: "#fff",
             border: "none",
             cursor: "pointer",
-            display: "flex",
+            display: "",
             alignItems: "center",
             justifyContent: "center",

[Survived] StringLiteral
src/VariantDevToolbar.tsx:146:25
             alignItems: "center",
             justifyContent: "center",
             boxShadow: "0 2px 8px rgba(0,0,0,0.32)",
-            transition: "background 0.15s",
+            transition: "",
             fontFamily:
               "-apple-system, BlinkMacSystemFont, 'Segoe UI', sans-serif",

[Survived] ObjectLiteral
src/VariantDevToolbar.tsx:167:18
           ref={panelRef}
           role="dialog"
           aria-label="Variant dev toolbar"
-          style={{
-            position: "fixed",
-            bottom: "68px",
-            right: "16px",
-            zIndex: 99999,
-            background: "#fff",
-            border: "1px solid #e5e5e5",
-            borderRadius: "12px",
-            boxShadow: "0 8px 32px rgba(0,0,0,0.16)",
-            padding: "16px",
-            minWidth: "240px",
-            maxWidth: "360px",
-            maxHeight: "70vh",
-            overflowY: "auto",
-            fontFamily:
-              "-apple-system, BlinkMacSystemFont, 'Segoe UI', sans-serif",
-            fontSize: "13px",
-          }}
+          style={{}}
         >
           {/* Header */}

[Survived] StringLiteral
src/VariantDevToolbar.tsx:168:23
           role="dialog"
           aria-label="Variant dev toolbar"
           style={{
-            position: "fixed",
+            position: "",
             bottom: "68px",
             right: "16px",

[Survived] StringLiteral
src/VariantDevToolbar.tsx:173:21
             right: "16px",
             zIndex: 99999,
             background: "#fff",
-            border: "1px solid #e5e5e5",
+            border: "",
             borderRadius: "12px",
             boxShadow: "0 8px 32px rgba(0,0,0,0.16)",

[Survived] StringLiteral
src/VariantDevToolbar.tsx:178:23
             boxShadow: "0 8px 32px rgba(0,0,0,0.16)",
             padding: "16px",
             minWidth: "240px",
-            maxWidth: "360px",
+            maxWidth: "",
             maxHeight: "70vh",
             overflowY: "auto",

[Survived] StringLiteral
src/VariantDevToolbar.tsx:179:24
             padding: "16px",
             minWidth: "240px",
             maxWidth: "360px",
-            maxHeight: "70vh",
+            maxHeight: "",
             overflowY: "auto",
             fontFamily:

[Survived] StringLiteral
src/VariantDevToolbar.tsx:182:15
             maxHeight: "70vh",
             overflowY: "auto",
             fontFamily:
-              "-apple-system, BlinkMacSystemFont, 'Segoe UI', sans-serif",
+              "",
             fontSize: "13px",
           }}

[Survived] StringLiteral
src/VariantDevToolbar.tsx:183:23
             overflowY: "auto",
             fontFamily:
               "-apple-system, BlinkMacSystemFont, 'Segoe UI', sans-serif",
-            fontSize: "13px",
+            fontSize: "",
           }}
         >

[Survived] ObjectLiteral
src/VariantDevToolbar.tsx:188:20
         >
           {/* Header */}
           <div
-            style={{
-              display: "flex",
-              alignItems: "center",
-              justifyContent: "space-between",
-              marginBottom: "12px",
-            }}
+            style={{}}
           >
             <span style={{ fontWeight: 700, color: "#171717", fontSize: "13px", display: "flex", alignItems: "center", gap: "6px" }}>

[Killed] BooleanLiteral
src/VariantDevToolbar.tsx:206:40
             </span>
             <button
               aria-label="Close toolbar"
-              onClick={() => setIsOpen(false)}
+              onClick={() => setIsOpen(true)}
               style={{
                 border: "none",
statusReason: expected <div role="dialog" …(2)>…(4)</div> to be null

[Killed] ArrowFunction
src/VariantDevToolbar.tsx:206:24
             </span>
             <button
               aria-label="Close toolbar"
-              onClick={() => setIsOpen(false)}
+              onClick={() => undefined}
               style={{
                 border: "none",
statusReason: expected <div role="dialog" …(2)>…(4)</div> to be null

[Survived] ObjectLiteral
src/VariantDevToolbar.tsx:207:22
             <button
               aria-label="Close toolbar"
               onClick={() => setIsOpen(false)}
-              style={{
-                border: "none",
-                background: "none",
-                cursor: "pointer",
-                fontSize: "16px",
-                color: "#737373",
-                padding: "2px 4px",
-                lineHeight: 1,
-              }}
+              style={{}}
             >
               ×

[Survived] StringLiteral
src/VariantDevToolbar.tsx:208:25
               aria-label="Close toolbar"
               onClick={() => setIsOpen(false)}
               style={{
-                border: "none",
+                border: "",
                 background: "none",
                 cursor: "pointer",

[Survived] StringLiteral
src/VariantDevToolbar.tsx:209:29
               onClick={() => setIsOpen(false)}
               style={{
                 border: "none",
-                background: "none",
+                background: "",
                 cursor: "pointer",
                 fontSize: "16px",

[Survived] StringLiteral
src/VariantDevToolbar.tsx:211:27
                 border: "none",
                 background: "none",
                 cursor: "pointer",
-                fontSize: "16px",
+                fontSize: "",
                 color: "#737373",
                 padding: "2px 4px",

[Survived] StringLiteral
src/VariantDevToolbar.tsx:225:22
           <div
             style={{
               fontSize: "11px",
-              color: "#a3a3a3",
+              color: "",
               marginBottom: "12px",
             }}

[Killed] ConditionalExpression
src/VariantDevToolbar.tsx:233:12
           </div>
 
           {/* Scope list */}
-          {scopeEntries.length === 0 ? (
+          {true ? (
             <div style={{ color: "#a3a3a3", fontSize: "12px" }}>
               No variant scopes registered yet.
statusReason: Unable to find an element with the text: Layout. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-expanded="true"
      aria-label="Toggle variant dev toolbar"

[Killed] EqualityOperator
src/VariantDevToolbar.tsx:233:12
           </div>
 
           {/* Scope list */}
-          {scopeEntries.length === 0 ? (
+          {scopeEntries.length !== 0 ? (
             <div style={{ color: "#a3a3a3", fontSize: "12px" }}>
               No variant scopes registered yet.
statusReason: Unable to find an element with the text: Layout. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-expanded="true"
      aria-label="Toggle variant dev toolbar"

[Survived] ObjectLiteral
src/VariantDevToolbar.tsx:234:25
 
           {/* Scope list */}
           {scopeEntries.length === 0 ? (
-            <div style={{ color: "#a3a3a3", fontSize: "12px" }}>
+            <div style={{}}>
               No variant scopes registered yet.
             </div>

[Killed] ArrowFunction
src/VariantDevToolbar.tsx:239:33
             </div>
           ) : (
             <div style={{ display: "flex", flexDirection: "column", gap: "12px" }}>
-              {scopeEntries.map(([scopeName, state]) => (
-                <ScopeControl
-                  key={scopeName}
-                  name={scopeName}
-                  state={state}
-                  onSelect={(variant) =>
-                    ctx.setActiveVariant(scopeName, variant)
-                  }
-                />
-              ))}
+              {scopeEntries.map(() => undefined)}
             </div>
           )}
statusReason: Unable to find an element with the text: Layout. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <button
      aria-expanded="true"
      aria-label="Toggle variant dev toolbar"

[Killed] ArrowFunction
src/VariantDevToolbar.tsx:244:29
                   key={scopeName}
                   name={scopeName}
                   state={state}
-                  onSelect={(variant) =>
-                    ctx.setActiveVariant(scopeName, variant)
+                  onSelect={() => undefined
                   }
                 />
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Survived] ObjectLiteral
src/VariantDevToolbar.tsx:254:20
 
           {/* UI toggle */}
           <div
-            style={{
-              marginTop: "16px",
-              paddingTop: "12px",
-              borderTop: "1px solid #f0f0f0",
-            }}
+            style={{}}
           >
             <button

[Survived] StringLiteral
src/VariantDevToolbar.tsx:256:27
           <div
             style={{
               marginTop: "16px",
-              paddingTop: "12px",
+              paddingTop: "",
               borderTop: "1px solid #f0f0f0",
             }}

[Survived] ObjectLiteral
src/VariantDevToolbar.tsx:262:22
           >
             <button
               onClick={ctx.toggleUiVisible}
-              style={{
-                width: "100%",
-                padding: "7px 12px",
-                border: "1px solid #e5e5e5",
-                borderRadius: "6px",
-                background: "none",
-                cursor: "pointer",
-                fontSize: "12px",
-                color: "#737373",
-                textAlign: "center",
-              }}
+              style={{}}
             >
               {ctx.uiVisible ? "Hide switchers (Alt+H)" : "Show switchers (Alt+H)"}

[Survived] StringLiteral
src/VariantDevToolbar.tsx:264:26
               onClick={ctx.toggleUiVisible}
               style={{
                 width: "100%",
-                padding: "7px 12px",
+                padding: "",
                 border: "1px solid #e5e5e5",
                 borderRadius: "6px",

[Survived] StringLiteral
src/VariantDevToolbar.tsx:266:31
                 width: "100%",
                 padding: "7px 12px",
                 border: "1px solid #e5e5e5",
-                borderRadius: "6px",
+                borderRadius: "",
                 background: "none",
                 cursor: "pointer",

[Survived] StringLiteral
src/VariantDevToolbar.tsx:268:25
                 border: "1px solid #e5e5e5",
                 borderRadius: "6px",
                 background: "none",
-                cursor: "pointer",
+                cursor: "",
                 fontSize: "12px",
                 color: "#737373",

[Survived] ObjectLiteral
src/VariantDevToolbar.tsx:297:16
   return (
     <div>
       <div
-        style={{
-          fontWeight: 600,
-          color: "#404040",
-          marginBottom: "6px",
-          fontSize: "12px",
-        }}
+        style={{}}
       >
         {name}

[Survived] StringLiteral
src/VariantDevToolbar.tsx:300:25
         style={{
           fontWeight: 600,
           color: "#404040",
-          marginBottom: "6px",
+          marginBottom: "",
           fontSize: "12px",
         }}

[Survived] StringLiteral
src/VariantDevToolbar.tsx:306:61
       >
         {name}
       </div>
-      <div style={{ display: "flex", flexWrap: "wrap", gap: "4px" }}>
+      <div style={{ display: "flex", flexWrap: "wrap", gap: "" }}>
         {state.variantNames.map((key) => {
           const isActive = key === state.activeVariant;

[Survived] StringLiteral
src/VariantDevToolbar.tsx:306:30
       >
         {name}
       </div>
-      <div style={{ display: "flex", flexWrap: "wrap", gap: "4px" }}>
+      <div style={{ display: "", flexWrap: "wrap", gap: "4px" }}>
         {state.variantNames.map((key) => {
           const isActive = key === state.activeVariant;

[Killed] BlockStatement
src/VariantDevToolbar.tsx:307:42
         {name}
       </div>
       <div style={{ display: "flex", flexWrap: "wrap", gap: "4px" }}>
-        {state.variantNames.map((key) => {
-          const isActive = key === state.activeVariant;
-          return (
-            <button
-              key={key}
-              role="radio"
-              aria-checked={isActive}
-              aria-label={`Switch ${name} to ${key}`}
-              onClick={() => onSelect(key)}
-              style={{
-                cursor: "pointer",
-                border: isActive ? "2px solid #171717" : "1px solid #e5e5e5",
-                borderRadius: "5px",
-                padding: "3px 10px",
-                fontSize: "11px",
-                fontWeight: isActive ? 600 : 400,
-                background: isActive ? "#171717" : "#fafafa",
-                color: isActive ? "#fff" : "#404040",
-                transition: "all 0.12s",
-              }}
-            >
-              {key}
-            </button>
-          );
-        })}
+        {state.variantNames.map((key) => {})}
       </div>
     </div>
statusReason: Unable to find an accessible element with the role "radio" and name `/Switch Layout to columns/`

Here are the accessible roles:

  button:

  Name "Toggle variant dev toolbar":
  <button

[Killed] ConditionalExpression
src/VariantDevToolbar.tsx:308:28
       </div>
       <div style={{ display: "flex", flexWrap: "wrap", gap: "4px" }}>
         {state.variantNames.map((key) => {
-          const isActive = key === state.activeVariant;
+          const isActive = false;
           return (
             <button
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] EqualityOperator
src/VariantDevToolbar.tsx:308:28
       </div>
       <div style={{ display: "flex", flexWrap: "wrap", gap: "4px" }}>
         {state.variantNames.map((key) => {
-          const isActive = key === state.activeVariant;
+          const isActive = key !== state.activeVariant;
           return (
             <button
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] StringLiteral
src/VariantDevToolbar.tsx:314:27
               key={key}
               role="radio"
               aria-checked={isActive}
-              aria-label={`Switch ${name} to ${key}`}
+              aria-label={``}
               onClick={() => onSelect(key)}
               style={{
statusReason: Unable to find an accessible element with the role "radio" and name `/Switch Layout to columns/`

Here are the accessible roles:

  button:

  Name "Toggle variant dev toolbar":
  <button

[Killed] ArrowFunction
src/VariantDevToolbar.tsx:315:24
               role="radio"
               aria-checked={isActive}
               aria-label={`Switch ${name} to ${key}`}
-              onClick={() => onSelect(key)}
+              onClick={() => undefined}
               style={{
                 cursor: "pointer",
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Survived] StringLiteral
src/VariantDevToolbar.tsx:317:25
               aria-label={`Switch ${name} to ${key}`}
               onClick={() => onSelect(key)}
               style={{
-                cursor: "pointer",
+                cursor: "",
                 border: isActive ? "2px solid #171717" : "1px solid #e5e5e5",
                 borderRadius: "5px",

[Survived] StringLiteral
src/VariantDevToolbar.tsx:318:58
               onClick={() => onSelect(key)}
               style={{
                 cursor: "pointer",
-                border: isActive ? "2px solid #171717" : "1px solid #e5e5e5",
+                border: isActive ? "2px solid #171717" : "",
                 borderRadius: "5px",
                 padding: "3px 10px",

[Survived] StringLiteral
src/VariantDevToolbar.tsx:319:31
               style={{
                 cursor: "pointer",
                 border: isActive ? "2px solid #171717" : "1px solid #e5e5e5",
-                borderRadius: "5px",
+                borderRadius: "",
                 padding: "3px 10px",
                 fontSize: "11px",
