[Killed] ArrowFunction
src/VariantSwitcher.tsx:38:31
   position = "right",
 }: SwitcherProps) {
   const ctx = useVariantContext();
-  const variantKeys = useMemo(() => Object.keys(variants), [variants]);
+  const variantKeys = useMemo(() => undefined, [variants]);
   const [expanded, setExpanded] = useState(false);
   const containerRef = useRef<HTMLDivElement>(null);
killedBy: VariantSwitcher renders the indicator dot by default
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BooleanLiteral
src/VariantSwitcher.tsx:39:44
 }: SwitcherProps) {
   const ctx = useVariantContext();
   const variantKeys = useMemo(() => Object.keys(variants), [variants]);
-  const [expanded, setExpanded] = useState(false);
+  const [expanded, setExpanded] = useState(true);
   const containerRef = useRef<HTMLDivElement>(null);
 
killedBy: VariantSwitcher renders the indicator dot by default
statusReason: Unable to find an accessible element with the role "button" and name `/Open variant switcher/`

Here are the accessible roles:

  toolbar:

  Name "Component variant switcher: Card":
  <div

[Survived] BooleanLiteral
src/VariantSwitcher.tsx:43:46
   const containerRef = useRef<HTMLDivElement>(null);
 
   // Dedup: only the first VariantSwitcher per scope renders
-  const [isPrimary, setIsPrimary] = useState(false);
+  const [isPrimary, setIsPrimary] = useState(true);
 
   useEffect(() => {

[Killed] BlockStatement
src/VariantSwitcher.tsx:45:19
   // Dedup: only the first VariantSwitcher per scope renders
   const [isPrimary, setIsPrimary] = useState(false);
 
-  useEffect(() => {
-    const primary = ctx.registerSwitcher(name);
-    setIsPrimary(primary);
-    return () => {
-      ctx.unregisterSwitcher(name);
-    };
-  }, [ctx, name]);
+  useEffect(() => {}, [ctx, name]);
 
   // Scope registration is handled by useVariant in the parent subtree.
killedBy: VariantSwitcher renders the indicator dot by default
statusReason: Unable to find an accessible element with the role "toolbar" and name `/Card/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] BlockStatement
src/VariantSwitcher.tsx:48:18
   useEffect(() => {
     const primary = ctx.registerSwitcher(name);
     setIsPrimary(primary);
-    return () => {
-      ctx.unregisterSwitcher(name);
-    };
+    return () => {};
   }, [ctx, name]);
 
killedBy: VariantSwitcher renders the indicator dot by default
statusReason: Unable to find an accessible element with the role "toolbar" and name `/Card/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Survived] BlockStatement
src/VariantSwitcher.tsx:55:19
 
   // Scope registration is handled by useVariant in the parent subtree.
   // Only register if useVariant is not present (standalone usage).
-  useEffect(() => {
-    ctx.registerScope(name, variantKeys);
-  }, [ctx, name, variantKeys]);
+  useEffect(() => {}, [ctx, name, variantKeys]);
 
   const activeKey = useActiveVariant(name, variantKeys);

[Killed] BlockStatement
src/VariantSwitcher.tsx:65:73
   // null = use default absolute positioning from the parent. Once dragged,
   // the element switches to position: fixed and persists to localStorage.
 
-  const [pos, setPos] = useState<{ x: number; y: number } | null>(() => {
-    try {
-      const saved = localStorage.getItem(`vf-variant-pos-${name}`);
-      if (saved) {
-        const parsed = JSON.parse(saved) as { x: number; y: number };
-        if (typeof parsed.x === "number" && typeof parsed.y === "number")
-          return parsed;
-      }
-    } catch { /* ignore */ }
-    return null;
-  });
+  const [pos, setPos] = useState<{ x: number; y: number } | null>(() => {});
   const [isDragging, setIsDragging] = useState(false);
   const [isHolding, setIsHolding] = useState(false);
killedBy: VariantSwitcher renders the indicator dot by default
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] BlockStatement
src/VariantSwitcher.tsx:66:9
   // the element switches to position: fixed and persists to localStorage.
 
   const [pos, setPos] = useState<{ x: number; y: number } | null>(() => {
-    try {
-      const saved = localStorage.getItem(`vf-variant-pos-${name}`);
-      if (saved) {
-        const parsed = JSON.parse(saved) as { x: number; y: number };
-        if (typeof parsed.x === "number" && typeof parsed.y === "number")
-          return parsed;
-      }
-    } catch { /* ignore */ }
+    try {} catch { /* ignore */ }
     return null;
   });
killedBy: VariantSwitcher drag to reposition restores saved position from localStorage on mount
statusReason: expected 'position: absolute; top: 50%; transfo…' to contain 'position: fixed'

[Killed] StringLiteral
src/VariantSwitcher.tsx:67:42
 
   const [pos, setPos] = useState<{ x: number; y: number } | null>(() => {
     try {
-      const saved = localStorage.getItem(`vf-variant-pos-${name}`);
+      const saved = localStorage.getItem(``);
       if (saved) {
         const parsed = JSON.parse(saved) as { x: number; y: number };
killedBy: VariantSwitcher drag to reposition restores saved position from localStorage on mount
statusReason: expected 'position: absolute; top: 50%; transfo…' to contain 'position: fixed'

[Killed] BlockStatement
src/VariantSwitcher.tsx:68:18
   const [pos, setPos] = useState<{ x: number; y: number } | null>(() => {
     try {
       const saved = localStorage.getItem(`vf-variant-pos-${name}`);
-      if (saved) {
-        const parsed = JSON.parse(saved) as { x: number; y: number };
-        if (typeof parsed.x === "number" && typeof parsed.y === "number")
-          return parsed;
-      }
+      if (saved) {}
     } catch { /* ignore */ }
     return null;
killedBy: VariantSwitcher drag to reposition restores saved position from localStorage on mount
statusReason: expected 'position: absolute; top: 50%; transfo…' to contain 'position: fixed'

[Killed] ConditionalExpression
src/VariantSwitcher.tsx:68:11
   const [pos, setPos] = useState<{ x: number; y: number } | null>(() => {
     try {
       const saved = localStorage.getItem(`vf-variant-pos-${name}`);
-      if (saved) {
+      if (false) {
         const parsed = JSON.parse(saved) as { x: number; y: number };
         if (typeof parsed.x === "number" && typeof parsed.y === "number")
killedBy: VariantSwitcher drag to reposition restores saved position from localStorage on mount
statusReason: expected 'position: absolute; top: 50%; transfo…' to contain 'position: fixed'

[Killed] EqualityOperator
src/VariantSwitcher.tsx:70:13
       const saved = localStorage.getItem(`vf-variant-pos-${name}`);
       if (saved) {
         const parsed = JSON.parse(saved) as { x: number; y: number };
-        if (typeof parsed.x === "number" && typeof parsed.y === "number")
+        if (typeof parsed.x !== "number" && typeof parsed.y === "number")
           return parsed;
       }
killedBy: VariantSwitcher drag to reposition restores saved position from localStorage on mount
statusReason: expected 'position: absolute; top: 50%; transfo…' to contain 'position: fixed'

[Killed] EqualityOperator
src/VariantSwitcher.tsx:70:45
       const saved = localStorage.getItem(`vf-variant-pos-${name}`);
       if (saved) {
         const parsed = JSON.parse(saved) as { x: number; y: number };
-        if (typeof parsed.x === "number" && typeof parsed.y === "number")
+        if (typeof parsed.x === "number" && typeof parsed.y !== "number")
           return parsed;
       }
killedBy: VariantSwitcher drag to reposition restores saved position from localStorage on mount
statusReason: expected 'position: absolute; top: 50%; transfo…' to contain 'position: fixed'

[Survived] BooleanLiteral
src/VariantSwitcher.tsx:76:48
     } catch { /* ignore */ }
     return null;
   });
-  const [isDragging, setIsDragging] = useState(false);
+  const [isDragging, setIsDragging] = useState(true);
   const [isHolding, setIsHolding] = useState(false);
   const dragOrigin = useRef<{

[Survived] BooleanLiteral
src/VariantSwitcher.tsx:77:46
     return null;
   });
   const [isDragging, setIsDragging] = useState(false);
-  const [isHolding, setIsHolding] = useState(false);
+  const [isHolding, setIsHolding] = useState(true);
   const dragOrigin = useRef<{
     mouseX: number;

[Survived] BooleanLiteral
src/VariantSwitcher.tsx:85:26
     posY: number;
   } | null>(null);
   const holdTimer = useRef<number | null>(null);
-  const didDrag = useRef(false);
+  const didDrag = useRef(true);
   // Track pos in a ref so the hold-timer callback always has the latest value
   const posRef = useRef<{ x: number; y: number } | null>(null);

[Survived] BlockStatement
src/VariantSwitcher.tsx:91:19
   posRef.current = pos;
 
   // Persist dragged position to localStorage
-  useEffect(() => {
-    if (pos !== null) {
-      try {
-        localStorage.setItem(`vf-variant-pos-${name}`, JSON.stringify(pos));
-      } catch { /* ignore */ }
-    }
-  }, [pos, name]);
+  useEffect(() => {}, [pos, name]);
 
   // Clear hold timer on unmount to avoid memory leaks

[Survived] ConditionalExpression
src/VariantSwitcher.tsx:92:9
 
   // Persist dragged position to localStorage
   useEffect(() => {
-    if (pos !== null) {
+    if (false) {
       try {
         localStorage.setItem(`vf-variant-pos-${name}`, JSON.stringify(pos));

[Survived] BlockStatement
src/VariantSwitcher.tsx:92:23
 
   // Persist dragged position to localStorage
   useEffect(() => {
-    if (pos !== null) {
-      try {
-        localStorage.setItem(`vf-variant-pos-${name}`, JSON.stringify(pos));
-      } catch { /* ignore */ }
-    }
+    if (pos !== null) {}
   }, [pos, name]);
 

[Survived] BlockStatement
src/VariantSwitcher.tsx:93:11
   // Persist dragged position to localStorage
   useEffect(() => {
     if (pos !== null) {
-      try {
-        localStorage.setItem(`vf-variant-pos-${name}`, JSON.stringify(pos));
-      } catch { /* ignore */ }
+      try {} catch { /* ignore */ }
     }
   }, [pos, name]);

[Survived] BlockStatement
src/VariantSwitcher.tsx:100:19
   }, [pos, name]);
 
   // Clear hold timer on unmount to avoid memory leaks
-  useEffect(() => {
-    return () => {
-      if (holdTimer.current !== null) window.clearTimeout(holdTimer.current);
-    };
-  }, []);
+  useEffect(() => {}, []);
 
   // Returns the current screen position of the container for drag start

[Survived] BlockStatement
src/VariantSwitcher.tsx:101:18
 
   // Clear hold timer on unmount to avoid memory leaks
   useEffect(() => {
-    return () => {
-      if (holdTimer.current !== null) window.clearTimeout(holdTimer.current);
-    };
+    return () => {};
   }, []);
 

[Survived] ConditionalExpression
src/VariantSwitcher.tsx:102:11
   // Clear hold timer on unmount to avoid memory leaks
   useEffect(() => {
     return () => {
-      if (holdTimer.current !== null) window.clearTimeout(holdTimer.current);
+      if (true) window.clearTimeout(holdTimer.current);
     };
   }, []);

[Survived] EqualityOperator
src/VariantSwitcher.tsx:102:11
   // Clear hold timer on unmount to avoid memory leaks
   useEffect(() => {
     return () => {
-      if (holdTimer.current !== null) window.clearTimeout(holdTimer.current);
+      if (holdTimer.current === null) window.clearTimeout(holdTimer.current);
     };
   }, []);

[NoCoverage] BlockStatement
src/VariantSwitcher.tsx:107:28
   }, []);
 
   // Returns the current screen position of the container for drag start
-  function getInitialPos() {
-    if (containerRef.current) {
-      const rect = containerRef.current.getBoundingClientRect();
-      return { x: rect.left, y: rect.top };
-    }
-    // Fallback: right edge of screen
-    return { x: window.innerWidth - 48, y: window.innerHeight / 2 };
-  }
+  function getInitialPos() {}
 
   function onDotPointerDown(e: React.PointerEvent<HTMLButtonElement>) {

[NoCoverage] BlockStatement
src/VariantSwitcher.tsx:108:31
 
   // Returns the current screen position of the container for drag start
   function getInitialPos() {
-    if (containerRef.current) {
-      const rect = containerRef.current.getBoundingClientRect();
-      return { x: rect.left, y: rect.top };
-    }
+    if (containerRef.current) {}
     // Fallback: right edge of screen
     return { x: window.innerWidth - 48, y: window.innerHeight / 2 };

[NoCoverage] ConditionalExpression
src/VariantSwitcher.tsx:108:9
 
   // Returns the current screen position of the container for drag start
   function getInitialPos() {
-    if (containerRef.current) {
+    if (true) {
       const rect = containerRef.current.getBoundingClientRect();
       return { x: rect.left, y: rect.top };

[NoCoverage] ArithmeticOperator
src/VariantSwitcher.tsx:113:44
       return { x: rect.left, y: rect.top };
     }
     // Fallback: right edge of screen
-    return { x: window.innerWidth - 48, y: window.innerHeight / 2 };
+    return { x: window.innerWidth - 48, y: window.innerHeight * 2 };
   }
 

[NoCoverage] ArithmeticOperator
src/VariantSwitcher.tsx:113:17
       return { x: rect.left, y: rect.top };
     }
     // Fallback: right edge of screen
-    return { x: window.innerWidth - 48, y: window.innerHeight / 2 };
+    return { x: window.innerWidth + 48, y: window.innerHeight / 2 };
   }
 

[Survived] BlockStatement
src/VariantSwitcher.tsx:116:71
     return { x: window.innerWidth - 48, y: window.innerHeight / 2 };
   }
 
-  function onDotPointerDown(e: React.PointerEvent<HTMLButtonElement>) {
-    // Capture values immediately — React clears currentTarget after the handler
-    const target = e.currentTarget;
-    const pointerId = e.pointerId;
-    const clientX = e.clientX;
-    const clientY = e.clientY;
-    didDrag.current = false;
-    // Start hold timer — after 300ms, unlock dragging
-    holdTimer.current = window.setTimeout(() => {
-      setIsHolding(true);
-      const startPos = posRef.current ?? getInitialPos();
-      dragOrigin.current = {
-        mouseX: clientX,
-        mouseY: clientY,
-        posX: startPos.x,
-        posY: startPos.y,
-      };
-      target.setPointerCapture(pointerId);
-    }, 300);
-  }
+  function onDotPointerDown(e: React.PointerEvent<HTMLButtonElement>) {}
 
   function onDotPointerMove(e: React.PointerEvent<HTMLButtonElement>) {

[Killed] BooleanLiteral
src/VariantSwitcher.tsx:122:23
     const pointerId = e.pointerId;
     const clientX = e.clientX;
     const clientY = e.clientY;
-    didDrag.current = false;
+    didDrag.current = true;
     // Start hold timer — after 300ms, unlock dragging
     holdTimer.current = window.setTimeout(() => {
killedBy: VariantSwitcher tapping the dot expands the picker
statusReason: Unable to find an accessible element with the role "radio" and name `/1/`

Here are the accessible roles:

  toolbar:

  Name "Component variant switcher: Card":
  <div

[NoCoverage] BlockStatement
src/VariantSwitcher.tsx:124:49
     const clientY = e.clientY;
     didDrag.current = false;
     // Start hold timer — after 300ms, unlock dragging
-    holdTimer.current = window.setTimeout(() => {
-      setIsHolding(true);
-      const startPos = posRef.current ?? getInitialPos();
-      dragOrigin.current = {
-        mouseX: clientX,
-        mouseY: clientY,
-        posX: startPos.x,
-        posY: startPos.y,
-      };
-      target.setPointerCapture(pointerId);
-    }, 300);
+    holdTimer.current = window.setTimeout(() => {}, 300);
   }
 

[NoCoverage] BooleanLiteral
src/VariantSwitcher.tsx:125:20
     didDrag.current = false;
     // Start hold timer — after 300ms, unlock dragging
     holdTimer.current = window.setTimeout(() => {
-      setIsHolding(true);
+      setIsHolding(false);
       const startPos = posRef.current ?? getInitialPos();
       dragOrigin.current = {

[NoCoverage] LogicalOperator
src/VariantSwitcher.tsx:126:24
     // Start hold timer — after 300ms, unlock dragging
     holdTimer.current = window.setTimeout(() => {
       setIsHolding(true);
-      const startPos = posRef.current ?? getInitialPos();
+      const startPos = posRef.current && getInitialPos();
       dragOrigin.current = {
         mouseX: clientX,

[NoCoverage] BlockStatement
src/VariantSwitcher.tsx:137:71
     }, 300);
   }
 
-  function onDotPointerMove(e: React.PointerEvent<HTMLButtonElement>) {
-    if (!dragOrigin.current) return;
-    const dx = e.clientX - dragOrigin.current.mouseX;
-    const dy = e.clientY - dragOrigin.current.mouseY;
-    if (!isDragging && (Math.abs(dx) > 3 || Math.abs(dy) > 3))
-      setIsDragging(true);
-    didDrag.current = true;
-    const bw = window.innerWidth;
-    const bh = window.innerHeight;
-    const x = Math.max(8, Math.min(bw - 40, dragOrigin.current.posX + dx));
-    const y = Math.max(8, Math.min(bh - 40, dragOrigin.current.posY + dy));
-    setPos({ x, y });
-  }
+  function onDotPointerMove(e: React.PointerEvent<HTMLButtonElement>) {}
 
   function onDotPointerUp() {

[NoCoverage] ConditionalExpression
src/VariantSwitcher.tsx:138:9
   }
 
   function onDotPointerMove(e: React.PointerEvent<HTMLButtonElement>) {
-    if (!dragOrigin.current) return;
+    if (true) return;
     const dx = e.clientX - dragOrigin.current.mouseX;
     const dy = e.clientY - dragOrigin.current.mouseY;

[NoCoverage] BooleanLiteral
src/VariantSwitcher.tsx:138:9
   }
 
   function onDotPointerMove(e: React.PointerEvent<HTMLButtonElement>) {
-    if (!dragOrigin.current) return;
+    if (dragOrigin.current) return;
     const dx = e.clientX - dragOrigin.current.mouseX;
     const dy = e.clientY - dragOrigin.current.mouseY;

[NoCoverage] ArithmeticOperator
src/VariantSwitcher.tsx:139:16
 
   function onDotPointerMove(e: React.PointerEvent<HTMLButtonElement>) {
     if (!dragOrigin.current) return;
-    const dx = e.clientX - dragOrigin.current.mouseX;
+    const dx = e.clientX + dragOrigin.current.mouseX;
     const dy = e.clientY - dragOrigin.current.mouseY;
     if (!isDragging && (Math.abs(dx) > 3 || Math.abs(dy) > 3))

[NoCoverage] ArithmeticOperator
src/VariantSwitcher.tsx:140:16
   function onDotPointerMove(e: React.PointerEvent<HTMLButtonElement>) {
     if (!dragOrigin.current) return;
     const dx = e.clientX - dragOrigin.current.mouseX;
-    const dy = e.clientY - dragOrigin.current.mouseY;
+    const dy = e.clientY + dragOrigin.current.mouseY;
     if (!isDragging && (Math.abs(dx) > 3 || Math.abs(dy) > 3))
       setIsDragging(true);

[NoCoverage] EqualityOperator
src/VariantSwitcher.tsx:141:45
     if (!dragOrigin.current) return;
     const dx = e.clientX - dragOrigin.current.mouseX;
     const dy = e.clientY - dragOrigin.current.mouseY;
-    if (!isDragging && (Math.abs(dx) > 3 || Math.abs(dy) > 3))
+    if (!isDragging && (Math.abs(dx) > 3 || Math.abs(dy) >= 3))
       setIsDragging(true);
     didDrag.current = true;

[NoCoverage] ConditionalExpression
src/VariantSwitcher.tsx:141:25
     if (!dragOrigin.current) return;
     const dx = e.clientX - dragOrigin.current.mouseX;
     const dy = e.clientY - dragOrigin.current.mouseY;
-    if (!isDragging && (Math.abs(dx) > 3 || Math.abs(dy) > 3))
+    if (!isDragging && (true))
       setIsDragging(true);
     didDrag.current = true;

[NoCoverage] BooleanLiteral
src/VariantSwitcher.tsx:142:21
     const dx = e.clientX - dragOrigin.current.mouseX;
     const dy = e.clientY - dragOrigin.current.mouseY;
     if (!isDragging && (Math.abs(dx) > 3 || Math.abs(dy) > 3))
-      setIsDragging(true);
+      setIsDragging(false);
     didDrag.current = true;
     const bw = window.innerWidth;

[NoCoverage] BooleanLiteral
src/VariantSwitcher.tsx:143:23
     const dy = e.clientY - dragOrigin.current.mouseY;
     if (!isDragging && (Math.abs(dx) > 3 || Math.abs(dy) > 3))
       setIsDragging(true);
-    didDrag.current = true;
+    didDrag.current = false;
     const bw = window.innerWidth;
     const bh = window.innerHeight;

[NoCoverage] ArithmeticOperator
src/VariantSwitcher.tsx:146:36
     didDrag.current = true;
     const bw = window.innerWidth;
     const bh = window.innerHeight;
-    const x = Math.max(8, Math.min(bw - 40, dragOrigin.current.posX + dx));
+    const x = Math.max(8, Math.min(bw + 40, dragOrigin.current.posX + dx));
     const y = Math.max(8, Math.min(bh - 40, dragOrigin.current.posY + dy));
     setPos({ x, y });

[NoCoverage] MethodExpression
src/VariantSwitcher.tsx:146:27
     didDrag.current = true;
     const bw = window.innerWidth;
     const bh = window.innerHeight;
-    const x = Math.max(8, Math.min(bw - 40, dragOrigin.current.posX + dx));
+    const x = Math.max(8, Math.max(bw - 40, dragOrigin.current.posX + dx));
     const y = Math.max(8, Math.min(bh - 40, dragOrigin.current.posY + dy));
     setPos({ x, y });

[NoCoverage] MethodExpression
src/VariantSwitcher.tsx:147:27
     const bw = window.innerWidth;
     const bh = window.innerHeight;
     const x = Math.max(8, Math.min(bw - 40, dragOrigin.current.posX + dx));
-    const y = Math.max(8, Math.min(bh - 40, dragOrigin.current.posY + dy));
+    const y = Math.max(8, Math.max(bh - 40, dragOrigin.current.posY + dy));
     setPos({ x, y });
   }

[NoCoverage] ArithmeticOperator
src/VariantSwitcher.tsx:147:36
     const bw = window.innerWidth;
     const bh = window.innerHeight;
     const x = Math.max(8, Math.min(bw - 40, dragOrigin.current.posX + dx));
-    const y = Math.max(8, Math.min(bh - 40, dragOrigin.current.posY + dy));
+    const y = Math.max(8, Math.min(bh + 40, dragOrigin.current.posY + dy));
     setPos({ x, y });
   }

[Killed] BlockStatement
src/VariantSwitcher.tsx:151:29
     setPos({ x, y });
   }
 
-  function onDotPointerUp() {
-    if (holdTimer.current !== null) {
-      window.clearTimeout(holdTimer.current);
-      holdTimer.current = null;
-    }
-    const wasDragged = didDrag.current;
-    dragOrigin.current = null;
-    setIsDragging(false);
-    setIsHolding(false);
-    didDrag.current = false;
-    // Only expand if the dot was tapped without dragging
-    if (!wasDragged) setExpanded(true);
-  }
+  function onDotPointerUp() {}
 
   function onDotPointerCancel() {
killedBy: VariantSwitcher tapping the dot expands the picker
statusReason: Unable to find an accessible element with the role "radio" and name `/1/`

Here are the accessible roles:

  toolbar:

  Name "Component variant switcher: Card":
  <div

[Survived] ConditionalExpression
src/VariantSwitcher.tsx:152:9
   }
 
   function onDotPointerUp() {
-    if (holdTimer.current !== null) {
+    if (true) {
       window.clearTimeout(holdTimer.current);
       holdTimer.current = null;

[Survived] BlockStatement
src/VariantSwitcher.tsx:152:37
   }
 
   function onDotPointerUp() {
-    if (holdTimer.current !== null) {
-      window.clearTimeout(holdTimer.current);
-      holdTimer.current = null;
-    }
+    if (holdTimer.current !== null) {}
     const wasDragged = didDrag.current;
     dragOrigin.current = null;

[Survived] BooleanLiteral
src/VariantSwitcher.tsx:158:19
     }
     const wasDragged = didDrag.current;
     dragOrigin.current = null;
-    setIsDragging(false);
+    setIsDragging(true);
     setIsHolding(false);
     didDrag.current = false;

[Survived] BooleanLiteral
src/VariantSwitcher.tsx:159:18
     const wasDragged = didDrag.current;
     dragOrigin.current = null;
     setIsDragging(false);
-    setIsHolding(false);
+    setIsHolding(true);
     didDrag.current = false;
     // Only expand if the dot was tapped without dragging

[Survived] BooleanLiteral
src/VariantSwitcher.tsx:160:23
     dragOrigin.current = null;
     setIsDragging(false);
     setIsHolding(false);
-    didDrag.current = false;
+    didDrag.current = true;
     // Only expand if the dot was tapped without dragging
     if (!wasDragged) setExpanded(true);

[Killed] ConditionalExpression
src/VariantSwitcher.tsx:162:9
     setIsHolding(false);
     didDrag.current = false;
     // Only expand if the dot was tapped without dragging
-    if (!wasDragged) setExpanded(true);
+    if (false) setExpanded(true);
   }
 
killedBy: VariantSwitcher tapping the dot expands the picker
statusReason: Unable to find an accessible element with the role "radio" and name `/1/`

Here are the accessible roles:

  toolbar:

  Name "Component variant switcher: Card":
  <div

[Killed] BooleanLiteral
src/VariantSwitcher.tsx:162:34
     setIsHolding(false);
     didDrag.current = false;
     // Only expand if the dot was tapped without dragging
-    if (!wasDragged) setExpanded(true);
+    if (!wasDragged) setExpanded(false);
   }
 
killedBy: VariantSwitcher tapping the dot expands the picker
statusReason: Unable to find an accessible element with the role "radio" and name `/1/`

Here are the accessible roles:

  toolbar:

  Name "Component variant switcher: Card":
  <div

[Survived] BlockStatement
src/VariantSwitcher.tsx:165:33
     if (!wasDragged) setExpanded(true);
   }
 
-  function onDotPointerCancel() {
-    if (holdTimer.current !== null) {
-      window.clearTimeout(holdTimer.current);
-      holdTimer.current = null;
-    }
-    dragOrigin.current = null;
-    setIsDragging(false);
-    setIsHolding(false);
-    didDrag.current = false;
-  }
+  function onDotPointerCancel() {}
 
   // ── Collapse on click outside ────────────────────────────────────────────────

[Survived] BlockStatement
src/VariantSwitcher.tsx:166:37
   }
 
   function onDotPointerCancel() {
-    if (holdTimer.current !== null) {
-      window.clearTimeout(holdTimer.current);
-      holdTimer.current = null;
-    }
+    if (holdTimer.current !== null) {}
     dragOrigin.current = null;
     setIsDragging(false);

[Survived] ConditionalExpression
src/VariantSwitcher.tsx:166:9
   }
 
   function onDotPointerCancel() {
-    if (holdTimer.current !== null) {
+    if (false) {
       window.clearTimeout(holdTimer.current);
       holdTimer.current = null;

[Killed] BlockStatement
src/VariantSwitcher.tsx:177:61
   }
 
   // ── Collapse on click outside ────────────────────────────────────────────────
-  const handleClickOutside = useCallback((e: MouseEvent) => {
-    if (
-      containerRef.current &&
-      !containerRef.current.contains(e.target as Node)
-    ) {
-      setExpanded(false);
-    }
-  }, []);
+  const handleClickOutside = useCallback((e: MouseEvent) => {}, []);
 
   useEffect(() => {
killedBy: VariantSwitcher clicking outside collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Killed] ConditionalExpression
src/VariantSwitcher.tsx:179:7
   // ── Collapse on click outside ────────────────────────────────────────────────
   const handleClickOutside = useCallback((e: MouseEvent) => {
     if (
-      containerRef.current &&
-      !containerRef.current.contains(e.target as Node)
+      false
     ) {
       setExpanded(false);
killedBy: VariantSwitcher clicking outside collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Survived] LogicalOperator
src/VariantSwitcher.tsx:179:7
   // ── Collapse on click outside ────────────────────────────────────────────────
   const handleClickOutside = useCallback((e: MouseEvent) => {
     if (
-      containerRef.current &&
-      !containerRef.current.contains(e.target as Node)
+      containerRef.current || !containerRef.current.contains(e.target as Node)
     ) {
       setExpanded(false);

[Killed] BooleanLiteral
src/VariantSwitcher.tsx:180:7
   const handleClickOutside = useCallback((e: MouseEvent) => {
     if (
       containerRef.current &&
-      !containerRef.current.contains(e.target as Node)
+      containerRef.current.contains(e.target as Node)
     ) {
       setExpanded(false);
killedBy: VariantSwitcher clicking outside collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Killed] BlockStatement
src/VariantSwitcher.tsx:181:7
     if (
       containerRef.current &&
       !containerRef.current.contains(e.target as Node)
-    ) {
-      setExpanded(false);
-    }
+    ) {}
   }, []);
 
killedBy: VariantSwitcher clicking outside collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Killed] BooleanLiteral
src/VariantSwitcher.tsx:182:19
       containerRef.current &&
       !containerRef.current.contains(e.target as Node)
     ) {
-      setExpanded(false);
+      setExpanded(true);
     }
   }, []);
killedBy: VariantSwitcher clicking outside collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Killed] BlockStatement
src/VariantSwitcher.tsx:186:19
     }
   }, []);
 
-  useEffect(() => {
-    if (expanded) {
-      document.addEventListener("mousedown", handleClickOutside);
-      return () => document.removeEventListener("mousedown", handleClickOutside);
-    }
-  }, [expanded, handleClickOutside]);
+  useEffect(() => {}, [expanded, handleClickOutside]);
 
   // Collapse on Escape
killedBy: VariantSwitcher clicking outside collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Killed] ConditionalExpression
src/VariantSwitcher.tsx:187:9
   }, []);
 
   useEffect(() => {
-    if (expanded) {
+    if (false) {
       document.addEventListener("mousedown", handleClickOutside);
       return () => document.removeEventListener("mousedown", handleClickOutside);
killedBy: VariantSwitcher clicking outside collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null
