[Killed] BlockStatement
src/VariantSwitcher.tsx:187:19
   }, []);
 
   useEffect(() => {
-    if (expanded) {
-      document.addEventListener("mousedown", handleClickOutside);
-      return () => document.removeEventListener("mousedown", handleClickOutside);
-    }
+    if (expanded) {}
   }, [expanded, handleClickOutside]);
 
killedBy: VariantSwitcher clicking outside collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Killed] StringLiteral
src/VariantSwitcher.tsx:188:33
 
   useEffect(() => {
     if (expanded) {
-      document.addEventListener("mousedown", handleClickOutside);
+      document.addEventListener("", handleClickOutside);
       return () => document.removeEventListener("mousedown", handleClickOutside);
     }
killedBy: VariantSwitcher clicking outside collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Survived] ArrowFunction
src/VariantSwitcher.tsx:189:14
   useEffect(() => {
     if (expanded) {
       document.addEventListener("mousedown", handleClickOutside);
-      return () => document.removeEventListener("mousedown", handleClickOutside);
+      return () => undefined;
     }
   }, [expanded, handleClickOutside]);

[Survived] StringLiteral
src/VariantSwitcher.tsx:189:49
   useEffect(() => {
     if (expanded) {
       document.addEventListener("mousedown", handleClickOutside);
-      return () => document.removeEventListener("mousedown", handleClickOutside);
+      return () => document.removeEventListener("", handleClickOutside);
     }
   }, [expanded, handleClickOutside]);

[Killed] BlockStatement
src/VariantSwitcher.tsx:194:19
   }, [expanded, handleClickOutside]);
 
   // Collapse on Escape
-  useEffect(() => {
-    if (!expanded) return;
-    const handleKeyDown = (e: KeyboardEvent) => {
-      if (e.key === "Escape") setExpanded(false);
-    };
-    document.addEventListener("keydown", handleKeyDown);
-    return () => document.removeEventListener("keydown", handleKeyDown);
-  }, [expanded]);
+  useEffect(() => {}, [expanded]);
 
   if (!ctx.uiVisible) return null;
killedBy: VariantSwitcher pressing Escape collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Killed] ConditionalExpression
src/VariantSwitcher.tsx:195:9
 
   // Collapse on Escape
   useEffect(() => {
-    if (!expanded) return;
+    if (true) return;
     const handleKeyDown = (e: KeyboardEvent) => {
       if (e.key === "Escape") setExpanded(false);
killedBy: VariantSwitcher pressing Escape collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Killed] BooleanLiteral
src/VariantSwitcher.tsx:195:9
 
   // Collapse on Escape
   useEffect(() => {
-    if (!expanded) return;
+    if (expanded) return;
     const handleKeyDown = (e: KeyboardEvent) => {
       if (e.key === "Escape") setExpanded(false);
killedBy: VariantSwitcher pressing Escape collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Killed] BlockStatement
src/VariantSwitcher.tsx:196:49
   // Collapse on Escape
   useEffect(() => {
     if (!expanded) return;
-    const handleKeyDown = (e: KeyboardEvent) => {
-      if (e.key === "Escape") setExpanded(false);
-    };
+    const handleKeyDown = (e: KeyboardEvent) => {};
     document.addEventListener("keydown", handleKeyDown);
     return () => document.removeEventListener("keydown", handleKeyDown);
killedBy: VariantSwitcher pressing Escape collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Killed] BooleanLiteral
src/VariantSwitcher.tsx:197:43
   useEffect(() => {
     if (!expanded) return;
     const handleKeyDown = (e: KeyboardEvent) => {
-      if (e.key === "Escape") setExpanded(false);
+      if (e.key === "Escape") setExpanded(true);
     };
     document.addEventListener("keydown", handleKeyDown);
killedBy: VariantSwitcher pressing Escape collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Killed] ConditionalExpression
src/VariantSwitcher.tsx:197:11
   useEffect(() => {
     if (!expanded) return;
     const handleKeyDown = (e: KeyboardEvent) => {
-      if (e.key === "Escape") setExpanded(false);
+      if (false) setExpanded(false);
     };
     document.addEventListener("keydown", handleKeyDown);
killedBy: VariantSwitcher pressing Escape collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Survived] ArrowFunction
src/VariantSwitcher.tsx:200:12
       if (e.key === "Escape") setExpanded(false);
     };
     document.addEventListener("keydown", handleKeyDown);
-    return () => document.removeEventListener("keydown", handleKeyDown);
+    return () => undefined;
   }, [expanded]);
 

[Killed] BooleanLiteral
src/VariantSwitcher.tsx:203:7
     return () => document.removeEventListener("keydown", handleKeyDown);
   }, [expanded]);
 
-  if (!ctx.uiVisible) return null;
+  if (ctx.uiVisible) return null;
   if (variantKeys.length < 2) return null;
   if (!isPrimary) return null;
killedBy: VariantSwitcher renders the indicator dot by default
statusReason: Unable to find an accessible element with the role "toolbar" and name `/Card/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] ConditionalExpression
src/VariantSwitcher.tsx:203:7
     return () => document.removeEventListener("keydown", handleKeyDown);
   }, [expanded]);
 
-  if (!ctx.uiVisible) return null;
+  if (true) return null;
   if (variantKeys.length < 2) return null;
   if (!isPrimary) return null;
killedBy: VariantSwitcher renders the indicator dot by default
statusReason: Unable to find an accessible element with the role "toolbar" and name `/Card/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] ConditionalExpression
src/VariantSwitcher.tsx:204:7
   }, [expanded]);
 
   if (!ctx.uiVisible) return null;
-  if (variantKeys.length < 2) return null;
+  if (true) return null;
   if (!isPrimary) return null;
 
killedBy: VariantSwitcher renders the indicator dot by default
statusReason: Unable to find an accessible element with the role "toolbar" and name `/Card/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] ConditionalExpression
src/VariantSwitcher.tsx:204:7
   }, [expanded]);
 
   if (!ctx.uiVisible) return null;
-  if (variantKeys.length < 2) return null;
+  if (false) return null;
   if (!isPrimary) return null;
 
killedBy: VariantSwitcher does not render with only one variant
statusReason: expected <div role="toolbar" …(3)>…(1)</div> to be null

[Killed] ConditionalExpression
src/VariantSwitcher.tsx:205:7
 
   if (!ctx.uiVisible) return null;
   if (variantKeys.length < 2) return null;
-  if (!isPrimary) return null;
+  if (true) return null;
 
   // ── Positioning: fixed when dragged, absolute (default) otherwise ────────────
killedBy: VariantSwitcher renders the indicator dot by default
statusReason: Unable to find an accessible element with the role "toolbar" and name `/Card/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] BooleanLiteral
src/VariantSwitcher.tsx:205:7
 
   if (!ctx.uiVisible) return null;
   if (variantKeys.length < 2) return null;
-  if (!isPrimary) return null;
+  if (isPrimary) return null;
 
   // ── Positioning: fixed when dragged, absolute (default) otherwise ────────────
killedBy: VariantSwitcher renders the indicator dot by default
statusReason: Unable to find an accessible element with the role "toolbar" and name `/Card/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] ConditionalExpression
src/VariantSwitcher.tsx:209:5
 
   // ── Positioning: fixed when dragged, absolute (default) otherwise ────────────
   const sideStyle: React.CSSProperties =
-    position === "left"
+    false
       ? { left: "-24px", right: "auto" }
       : { right: "-24px", left: "auto" };
killedBy: VariantSwitcher position=left places switcher on the left
statusReason: expected 'position: absolute; top: 50%; transfo…' to contain 'left: -24px'

[Killed] ConditionalExpression
src/VariantSwitcher.tsx:209:5
 
   // ── Positioning: fixed when dragged, absolute (default) otherwise ────────────
   const sideStyle: React.CSSProperties =
-    position === "left"
+    true
       ? { left: "-24px", right: "auto" }
       : { right: "-24px", left: "auto" };
killedBy: VariantSwitcher position=right (default) places switcher on the right
statusReason: expected 'position: absolute; top: 50%; transfo…' to contain 'right: -24px'

[Survived] StringLiteral
src/VariantSwitcher.tsx:210:33
   // ── Positioning: fixed when dragged, absolute (default) otherwise ────────────
   const sideStyle: React.CSSProperties =
     position === "left"
-      ? { left: "-24px", right: "auto" }
+      ? { left: "-24px", right: "" }
       : { right: "-24px", left: "auto" };
 

[Killed] ObjectLiteral
src/VariantSwitcher.tsx:211:9
   const sideStyle: React.CSSProperties =
     position === "left"
       ? { left: "-24px", right: "auto" }
-      : { right: "-24px", left: "auto" };
+      : {};
 
   const containerStyle: React.CSSProperties =
killedBy: VariantSwitcher position=right (default) places switcher on the right
statusReason: expected 'position: absolute; top: 50%; transfo…' to contain 'right: -24px'

[Killed] ConditionalExpression
src/VariantSwitcher.tsx:214:5
       : { right: "-24px", left: "auto" };
 
   const containerStyle: React.CSSProperties =
-    pos !== null
+    true
       ? {
           position: "fixed",
killedBy: VariantSwitcher renders the indicator dot by default
statusReason: Cannot read properties of null (reading 'x')

[Killed] EqualityOperator
src/VariantSwitcher.tsx:214:5
       : { right: "-24px", left: "auto" };
 
   const containerStyle: React.CSSProperties =
-    pos !== null
+    pos === null
       ? {
           position: "fixed",
killedBy: VariantSwitcher renders the indicator dot by default
statusReason: Cannot read properties of null (reading 'x')

[Killed] ObjectLiteral
src/VariantSwitcher.tsx:222:9
           transform: "none",
           zIndex: 9999,
         }
-      : {
-          position: "absolute",
-          top: "50%",
-          transform: "translateY(-50%)",
-          ...sideStyle,
-          zIndex: 9999,
-        };
+      : {};
 
   const dotTitle = isDragging
killedBy: VariantSwitcher position=left places switcher on the left
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[NoCoverage] StringLiteral
src/VariantSwitcher.tsx:233:9
   const dotTitle = isDragging
     ? "Drag to reposition"
     : isHolding
-      ? "Drag to reposition · Release to expand"
+      ? ""
       : `${name} variants — click to switch · hold to drag`;
 

[Survived] StringLiteral
src/VariantSwitcher.tsx:234:9
     ? "Drag to reposition"
     : isHolding
       ? "Drag to reposition · Release to expand"
-      : `${name} variants — click to switch · hold to drag`;
+      : ``;
 
   return (

[Survived] StringLiteral
src/VariantSwitcher.tsx:251:25
             display: "flex",
             flexDirection: "column",
             gap: "3px",
-            background: "#fff",
+            background: "",
             border: "1px solid #e5e5e5",
             borderRadius: "4px",

[Killed] ConditionalExpression
src/VariantSwitcher.tsx:261:30
           }}
         >
           {variantKeys.map((key, index) => {
-            const isActive = key === activeKey;
+            const isActive = false;
             return (
               <button
killedBy: VariantSwitcher first variant is active by default
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] EqualityOperator
src/VariantSwitcher.tsx:261:30
           }}
         >
           {variantKeys.map((key, index) => {
-            const isActive = key === activeKey;
+            const isActive = key !== activeKey;
             return (
               <button
killedBy: VariantSwitcher first variant is active by default
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] ArithmeticOperator
src/VariantSwitcher.tsx:267:58
                 key={key}
                 role="radio"
                 aria-checked={isActive}
-                aria-label={`Switch to ${key} variant (${index + 1})`}
+                aria-label={`Switch to ${key} variant (${index - 1})`}
                 onClick={() => {
                   ctx.setActiveVariant(name, key);
killedBy: VariantSwitcher tapping the dot expands the picker
statusReason: Found multiple elements with the role "radio" and name `/1/`

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  aria-checked="true"
  aria-label="Switch to default variant (-1)"

[Killed] BlockStatement
src/VariantSwitcher.tsx:268:32
                 role="radio"
                 aria-checked={isActive}
                 aria-label={`Switch to ${key} variant (${index + 1})`}
-                onClick={() => {
-                  ctx.setActiveVariant(name, key);
-                  setExpanded(false);
-                }}
+                onClick={() => {}}
                 title={key}
                 style={{
killedBy: VariantSwitcher clicking a variant selects it and collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Killed] BooleanLiteral
src/VariantSwitcher.tsx:270:31
                 aria-label={`Switch to ${key} variant (${index + 1})`}
                 onClick={() => {
                   ctx.setActiveVariant(name, key);
-                  setExpanded(false);
+                  setExpanded(true);
                 }}
                 title={key}
killedBy: VariantSwitcher clicking a variant selects it and collapses the picker
statusReason: expected <button role="radio" …(4)></button> to be null

[Survived] ObjectLiteral
src/VariantSwitcher.tsx:273:24
                   setExpanded(false);
                 }}
                 title={key}
-                style={{
-                  cursor: "pointer",
-                  border: "none",
-                  outline: "none",
-                  width: "22px",
-                  height: "22px",
-                  borderRadius: "3px",
-                  fontSize: "10px",
-                  fontWeight: isActive ? 700 : 400,
-                  background: isActive ? "#171717" : "transparent",
-                  color: isActive ? "#fff" : "#737373",
-                  display: "flex",
-                  alignItems: "center",
-                  justifyContent: "center",
-                  transition: "background 0.12s, color 0.12s",
-                  padding: 0,
-                  lineHeight: 1,
-                }}
+                style={{}}
               >
                 {index + 1}

[Survived] StringLiteral
src/VariantSwitcher.tsx:275:27
                 title={key}
                 style={{
                   cursor: "pointer",
-                  border: "none",
+                  border: "",
                   outline: "none",
                   width: "22px",

[Survived] StringLiteral
src/VariantSwitcher.tsx:276:28
                 style={{
                   cursor: "pointer",
                   border: "none",
-                  outline: "none",
+                  outline: "",
                   width: "22px",
                   height: "22px",

[Survived] StringLiteral
src/VariantSwitcher.tsx:277:26
                   cursor: "pointer",
                   border: "none",
                   outline: "none",
-                  width: "22px",
+                  width: "",
                   height: "22px",
                   borderRadius: "3px",

[Survived] StringLiteral
src/VariantSwitcher.tsx:282:42
                   borderRadius: "3px",
                   fontSize: "10px",
                   fontWeight: isActive ? 700 : 400,
-                  background: isActive ? "#171717" : "transparent",
+                  background: isActive ? "" : "transparent",
                   color: isActive ? "#fff" : "#737373",
                   display: "flex",

[Survived] StringLiteral
src/VariantSwitcher.tsx:287:31
                   display: "flex",
                   alignItems: "center",
                   justifyContent: "center",
-                  transition: "background 0.12s, color 0.12s",
+                  transition: "",
                   padding: 0,
                   lineHeight: 1,

[Survived] ArithmeticOperator
src/VariantSwitcher.tsx:292:18
                   lineHeight: 1,
                 }}
               >
-                {index + 1}
+                {index - 1}
               </button>
             );

[Killed] StringLiteral
src/VariantSwitcher.tsx:300:23
       ) : (
         /* Collapsed: draggable indicator dot */
         <button
-          aria-label={`Open variant switcher for ${name}`}
+          aria-label={``}
           title={dotTitle}
           onPointerDown={onDotPointerDown}
killedBy: VariantSwitcher renders the indicator dot by default
statusReason: Unable to find an accessible element with the role "button" and name `/Open variant switcher/`

Here are the accessible roles:

  toolbar:

  Name "Component variant switcher: Card":
  <div

[Survived] ObjectLiteral
src/VariantSwitcher.tsx:306:18
           onPointerMove={onDotPointerMove}
           onPointerUp={onDotPointerUp}
           onPointerCancel={onDotPointerCancel}
-          style={{
-            cursor: isDragging ? "grabbing" : isHolding ? "grab" : "pointer",
-            border: "1px solid #e5e5e5",
-            outline: "none",
-            width: "14px",
-            height: "14px",
-            borderRadius: "50%",
-            background: isDragging ? "#e5e5e5" : "#f5f5f5",
-            padding: 0,
-            display: "flex",
-            alignItems: "center",
-            justifyContent: "center",
-            boxShadow: isDragging
-              ? "0 2px 8px rgba(0,0,0,0.14)"
-              : "0 1px 2px rgba(0,0,0,0.06)",
-            transition: isDragging
-              ? "none"
-              : "background 0.15s, border-color 0.15s",
-          }}
+          style={{}}
           onMouseEnter={(e) => {
             if (isDragging) return;

[NoCoverage] StringLiteral
src/VariantSwitcher.tsx:307:59
           onPointerUp={onDotPointerUp}
           onPointerCancel={onDotPointerCancel}
           style={{
-            cursor: isDragging ? "grabbing" : isHolding ? "grab" : "pointer",
+            cursor: isDragging ? "grabbing" : isHolding ? "" : "pointer",
             border: "1px solid #e5e5e5",
             outline: "none",

[Survived] StringLiteral
src/VariantSwitcher.tsx:315:22
             borderRadius: "50%",
             background: isDragging ? "#e5e5e5" : "#f5f5f5",
             padding: 0,
-            display: "flex",
+            display: "",
             alignItems: "center",
             justifyContent: "center",

[Survived] StringLiteral
src/VariantSwitcher.tsx:316:25
             background: isDragging ? "#e5e5e5" : "#f5f5f5",
             padding: 0,
             display: "flex",
-            alignItems: "center",
+            alignItems: "",
             justifyContent: "center",
             boxShadow: isDragging

[Survived] StringLiteral
src/VariantSwitcher.tsx:320:17
             justifyContent: "center",
             boxShadow: isDragging
               ? "0 2px 8px rgba(0,0,0,0.14)"
-              : "0 1px 2px rgba(0,0,0,0.06)",
+              : "",
             transition: isDragging
               ? "none"

[NoCoverage] StringLiteral
src/VariantSwitcher.tsx:322:17
               ? "0 2px 8px rgba(0,0,0,0.14)"
               : "0 1px 2px rgba(0,0,0,0.06)",
             transition: isDragging
-              ? "none"
+              ? ""
               : "background 0.15s, border-color 0.15s",
           }}

[NoCoverage] BlockStatement
src/VariantSwitcher.tsx:325:32
               ? "none"
               : "background 0.15s, border-color 0.15s",
           }}
-          onMouseEnter={(e) => {
-            if (isDragging) return;
-            e.currentTarget.style.background = "#e5e5e5";
-            e.currentTarget.style.borderColor = "#d4d4d4";
-          }}
+          onMouseEnter={(e) => {}}
           onMouseLeave={(e) => {
             if (isDragging) return;

[NoCoverage] ConditionalExpression
src/VariantSwitcher.tsx:326:17
               : "background 0.15s, border-color 0.15s",
           }}
           onMouseEnter={(e) => {
-            if (isDragging) return;
+            if (true) return;
             e.currentTarget.style.background = "#e5e5e5";
             e.currentTarget.style.borderColor = "#d4d4d4";

[NoCoverage] ConditionalExpression
src/VariantSwitcher.tsx:326:17
               : "background 0.15s, border-color 0.15s",
           }}
           onMouseEnter={(e) => {
-            if (isDragging) return;
+            if (false) return;
             e.currentTarget.style.background = "#e5e5e5";
             e.currentTarget.style.borderColor = "#d4d4d4";

[NoCoverage] StringLiteral
src/VariantSwitcher.tsx:327:48
           }}
           onMouseEnter={(e) => {
             if (isDragging) return;
-            e.currentTarget.style.background = "#e5e5e5";
+            e.currentTarget.style.background = "";
             e.currentTarget.style.borderColor = "#d4d4d4";
           }}

[NoCoverage] BlockStatement
src/VariantSwitcher.tsx:330:32
             e.currentTarget.style.background = "#e5e5e5";
             e.currentTarget.style.borderColor = "#d4d4d4";
           }}
-          onMouseLeave={(e) => {
-            if (isDragging) return;
-            e.currentTarget.style.background = "#f5f5f5";
-            e.currentTarget.style.borderColor = "#e5e5e5";
-          }}
+          onMouseLeave={(e) => {}}
         >
           {/* Active variant indicator — tiny inner dot */}

[NoCoverage] ConditionalExpression
src/VariantSwitcher.tsx:331:17
             e.currentTarget.style.borderColor = "#d4d4d4";
           }}
           onMouseLeave={(e) => {
-            if (isDragging) return;
+            if (true) return;
             e.currentTarget.style.background = "#f5f5f5";
             e.currentTarget.style.borderColor = "#e5e5e5";

[NoCoverage] ConditionalExpression
src/VariantSwitcher.tsx:331:17
             e.currentTarget.style.borderColor = "#d4d4d4";
           }}
           onMouseLeave={(e) => {
-            if (isDragging) return;
+            if (false) return;
             e.currentTarget.style.background = "#f5f5f5";
             e.currentTarget.style.borderColor = "#e5e5e5";

[Survived] StringLiteral
src/VariantSwitcher.tsx:339:22
           {/* Active variant indicator — tiny inner dot */}
           <span
             style={{
-              width: "5px",
+              width: "",
               height: "5px",
               borderRadius: "50%",

[Survived] StringLiteral
src/VariantSwitcher.tsx:340:23
           <span
             style={{
               width: "5px",
-              height: "5px",
+              height: "",
               borderRadius: "50%",
               background: "#a3a3a3",
