[Survived] ArrayDeclaration
src/PageVariantSwitcher.tsx:35:60
   variants,
 }: PageVariantSwitcherProps) {
   const ctx = useVariantContext();
-  const variantKeys = useMemo(() => Object.keys(variants), [variants]);
+  const variantKeys = useMemo(() => Object.keys(variants), []);
 
   // Scope registration is handled by useVariant in the parent subtree.

[Killed] ConditionalExpression
src/PageVariantSwitcher.tsx:45:7
 
   const activeKey = useActiveVariant(name, variantKeys);
 
-  if (!ctx.uiVisible) return null;
+  if (false) return null;
   if (variantKeys.length < 2) return null;
 
killedBy: PageVariantSwitcher is hidden when uiVisible is false
statusReason: expected <div role="toolbar" …(2)>…(3)</div> to be null

[Killed] EqualityOperator
src/PageVariantSwitcher.tsx:46:7
   const activeKey = useActiveVariant(name, variantKeys);
 
   if (!ctx.uiVisible) return null;
-  if (variantKeys.length < 2) return null;
+  if (variantKeys.length >= 2) return null;
 
   return (
killedBy: PageVariantSwitcher renders the toolbar with variant buttons
statusReason: Unable to find an accessible element with the role "toolbar" and name `/Layout/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] ObjectLiteral
src/PageVariantSwitcher.tsx:52:14
     <div
       role="toolbar"
       aria-label={`Page variant switcher: ${name}`}
-      style={{
-        position: "fixed",
-        top: "12px",
-        left: "12px",
-        zIndex: 99999,
-        display: "flex",
-        alignItems: "center",
-        background: "#171717",
-        borderRadius: "8px",
-        padding: "4px",
-        gap: "2px",
-        boxShadow: "0 2px 8px rgba(0,0,0,0.32)",
-        fontFamily:
-          "-apple-system, BlinkMacSystemFont, 'Segoe UI', sans-serif",
-        fontSize: "12px",
-        userSelect: "none",
-      }}
+      style={{}}
     >
       {variantKeys.map((key) => {

[Survived] StringLiteral
src/PageVariantSwitcher.tsx:66:19
         boxShadow: "0 2px 8px rgba(0,0,0,0.32)",
         fontFamily:
           "-apple-system, BlinkMacSystemFont, 'Segoe UI', sans-serif",
-        fontSize: "12px",
+        fontSize: "",
         userSelect: "none",
       }}

[Killed] EqualityOperator
src/PageVariantSwitcher.tsx:71:26
       }}
     >
       {variantKeys.map((key) => {
-        const isActive = key === activeKey;
+        const isActive = key !== activeKey;
         return (
           <button
killedBy: PageVariantSwitcher first variant is active by default
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] ConditionalExpression
src/PageVariantSwitcher.tsx:71:26
       }}
     >
       {variantKeys.map((key) => {
-        const isActive = key === activeKey;
+        const isActive = true;
         return (
           <button
killedBy: PageVariantSwitcher clicking a variant marks it as active
statusReason: expect(element).toHaveAttribute("aria-checked", "false") // element.getAttribute("aria-checked") === "false"

Expected the element to have attribute:
  aria-checked="false"
Received:
  aria-checked="true"

[Survived] StringLiteral
src/PageVariantSwitcher.tsx:77:25
             key={key}
             role="radio"
             aria-checked={isActive}
-            aria-label={`Switch to ${key} variant`}
+            aria-label={``}
             onClick={() => ctx.setActiveVariant(name, key)}
             style={{

[Killed] ArrowFunction
src/PageVariantSwitcher.tsx:78:22
             role="radio"
             aria-checked={isActive}
             aria-label={`Switch to ${key} variant`}
-            onClick={() => ctx.setActiveVariant(name, key)}
+            onClick={() => undefined}
             style={{
               cursor: "pointer",
killedBy: PageVariantSwitcher clicking a variant marks it as active
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Survived] StringLiteral
src/PageVariantSwitcher.tsx:84:24
               border: "none",
               outline: "none",
               borderRadius: "5px",
-              padding: "5px 12px",
+              padding: "",
               fontSize: "12px",
               fontWeight: isActive ? 600 : 400,

[Survived] StringLiteral
src/PageVariantSwitcher.tsx:88:33
               fontSize: "12px",
               fontWeight: isActive ? 600 : 400,
               background: isActive ? "#ffffff" : "transparent",
-              color: isActive ? "#171717" : "#a3a3a3",
+              color: isActive ? "" : "#a3a3a3",
               transition: "background 0.15s, color 0.15s",
               whiteSpace: "nowrap",

[Survived] StringLiteral
src/PageVariantSwitcher.tsx:89:27
               fontWeight: isActive ? 600 : 400,
               background: isActive ? "#ffffff" : "transparent",
               color: isActive ? "#171717" : "#a3a3a3",
-              transition: "background 0.15s, color 0.15s",
+              transition: "",
               whiteSpace: "nowrap",
             }}
