[Killed] BlockStatement
src/context.tsx:32:58
 export const VariantContext = createContext<VariantContextValue | null>(null);
 
 /** Access the variant context. Throws if used outside VariantProvider. */
-export function useVariantContext(): VariantContextValue {
-  const ctx = useContext(VariantContext);
-  if (!ctx) {
-    throw new Error("useVariantContext must be used inside <VariantProvider>");
-  }
-  return ctx;
-}
+export function useVariantContext(): VariantContextValue {}
 
 // ---------------------------------------------------------------------------
statusReason: Cannot read properties of undefined (reading 'getActiveVariant')

[Killed] ConditionalExpression
src/context.tsx:34:7
 /** Access the variant context. Throws if used outside VariantProvider. */
 export function useVariantContext(): VariantContextValue {
   const ctx = useContext(VariantContext);
-  if (!ctx) {
+  if (true) {
     throw new Error("useVariantContext must be used inside <VariantProvider>");
   }
statusReason: useVariantContext must be used inside <VariantProvider>

[Killed] BlockStatement
src/context.tsx:34:13
 /** Access the variant context. Throws if used outside VariantProvider. */
 export function useVariantContext(): VariantContextValue {
   const ctx = useContext(VariantContext);
-  if (!ctx) {
-    throw new Error("useVariantContext must be used inside <VariantProvider>");
-  }
+  if (!ctx) {}
   return ctx;
 }
killedBy: VariantProvider throws when useVariantContext used outside provider
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/context.tsx:35:21
 export function useVariantContext(): VariantContextValue {
   const ctx = useContext(VariantContext);
   if (!ctx) {
-    throw new Error("useVariantContext must be used inside <VariantProvider>");
+    throw new Error("");
   }
   return ctx;
killedBy: VariantProvider throws when useVariantContext used outside provider
statusReason: expected [Function] to throw error including 'useVariantContext must be used inside…' but got ''

[Killed] BlockStatement
src/context.tsx:48:12
 function resolveInitialUiVisible(
   mode: VariantMode,
   defaultVisible: boolean | undefined,
-): boolean {
-  // "always" mode: respect defaultVisible, fallback to true
-  if (mode === "always") {
-    return defaultVisible ?? true;
-  }
-  // "dev" mode: check localStorage first, then defaultVisible, then true
-  // (dev defaults to visible so devs see switchers immediately)
-  const persisted = readUiVisibleFromStorage();
-  if (persisted !== null) return persisted;
-  return defaultVisible ?? true;
-}
+): boolean {}
 
 /**
statusReason: Unable to find an accessible element with the role "button" and name `/Toggle variant dev toolbar/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />

[Killed] EqualityOperator
src/context.tsx:50:7
   defaultVisible: boolean | undefined,
 ): boolean {
   // "always" mode: respect defaultVisible, fallback to true
-  if (mode === "always") {
+  if (mode !== "always") {
     return defaultVisible ?? true;
   }
killedBy: VariantProvider reads persisted uiVisible from localStorage
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/context.tsx:50:7
   defaultVisible: boolean | undefined,
 ): boolean {
   // "always" mode: respect defaultVisible, fallback to true
-  if (mode === "always") {
+  if (true) {
     return defaultVisible ?? true;
   }
killedBy: VariantProvider reads persisted uiVisible from localStorage
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
src/context.tsx:51:30
 ): boolean {
   // "always" mode: respect defaultVisible, fallback to true
   if (mode === "always") {
-    return defaultVisible ?? true;
+    return defaultVisible ?? false;
   }
   // "dev" mode: check localStorage first, then defaultVisible, then true

[Survived] LogicalOperator
src/context.tsx:51:12
 ): boolean {
   // "always" mode: respect defaultVisible, fallback to true
   if (mode === "always") {
-    return defaultVisible ?? true;
+    return defaultVisible && true;
   }
   // "dev" mode: check localStorage first, then defaultVisible, then true

[Killed] ConditionalExpression
src/context.tsx:56:7
   // "dev" mode: check localStorage first, then defaultVisible, then true
   // (dev defaults to visible so devs see switchers immediately)
   const persisted = readUiVisibleFromStorage();
-  if (persisted !== null) return persisted;
+  if (true) return persisted;
   return defaultVisible ?? true;
 }
statusReason: Unable to find an accessible element with the role "toolbar" and name `/Card/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] EqualityOperator
src/context.tsx:56:7
   // "dev" mode: check localStorage first, then defaultVisible, then true
   // (dev defaults to visible so devs see switchers immediately)
   const persisted = readUiVisibleFromStorage();
-  if (persisted !== null) return persisted;
+  if (persisted === null) return persisted;
   return defaultVisible ?? true;
 }
statusReason: Unable to find an accessible element with the role "toolbar" and name `/Card/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] BooleanLiteral
src/context.tsx:57:28
   // (dev defaults to visible so devs see switchers immediately)
   const persisted = readUiVisibleFromStorage();
   if (persisted !== null) return persisted;
-  return defaultVisible ?? true;
+  return defaultVisible ?? false;
 }
 
statusReason: Unable to find an accessible element with the role "toolbar"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] LogicalOperator
src/context.tsx:57:10
   // (dev defaults to visible so devs see switchers immediately)
   const persisted = readUiVisibleFromStorage();
   if (persisted !== null) return persisted;
-  return defaultVisible ?? true;
+  return defaultVisible && true;
 }
 
statusReason: Unable to find an accessible element with the role "toolbar"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] StringLiteral
src/context.tsx:78:10
  */
 export function VariantProvider({
   children,
-  mode = "dev",
+  mode = "",
   defaultVisible,
   shortcuts,
killedBy: VariantProvider provides default mode as 'dev'
statusReason: expected '' to be 'dev' // Object.is equality

[Killed] ArrowFunction
src/context.tsx:83:55
   shortcuts,
 }: VariantProviderProps): ReactNode {
   const [scopes, setScopes] = useState<Record<string, VariantState>>({});
-  const [uiVisible, setUiVisible] = useState<boolean>(() =>
-    resolveInitialUiVisible(mode, defaultVisible),
+  const [uiVisible, setUiVisible] = useState<boolean>(() => undefined,
   );
 
statusReason: Unable to find an accessible element with the role "button" and name `/Toggle variant dev toolbar/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />

[Killed] BlockStatement
src/context.tsx:91:47
   const registeredSwitchers = useRef(new Set<string>());
 
   const registerScope = useCallback(
-    (name: string, variantNames: string[]) => {
-      setScopes((prev) => {
-        // Avoid unnecessary re-renders if scope already registered with same names
-        const existing = prev[name];
-        if (
-          existing &&
-          existing.variantNames.length === variantNames.length &&
-          existing.variantNames.every((v, i) => v === variantNames[i])
-        ) {
-          return prev;
-        }
-        const firstKey = variantNames[0] ?? "default";
-        const activeVariant = resolveActiveVariant(
-          name,
-          variantNames,
-          existing?.activeVariant ?? firstKey,
-        );
-        return { ...prev, [name]: { activeVariant, variantNames } };
-      });
-    },
+    (name: string, variantNames: string[]) => {},
     [],
   );
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] BlockStatement
src/context.tsx:92:27
 
   const registerScope = useCallback(
     (name: string, variantNames: string[]) => {
-      setScopes((prev) => {
-        // Avoid unnecessary re-renders if scope already registered with same names
-        const existing = prev[name];
-        if (
-          existing &&
-          existing.variantNames.length === variantNames.length &&
-          existing.variantNames.every((v, i) => v === variantNames[i])
-        ) {
-          return prev;
-        }
-        const firstKey = variantNames[0] ?? "default";
-        const activeVariant = resolveActiveVariant(
-          name,
-          variantNames,
-          existing?.activeVariant ?? firstKey,
-        );
-        return { ...prev, [name]: { activeVariant, variantNames } };
-      });
+      setScopes((prev) => {});
     },
     [],
statusReason: Cannot convert undefined or null to object

[Killed] LogicalOperator
src/context.tsx:96:11
         // Avoid unnecessary re-renders if scope already registered with same names
         const existing = prev[name];
         if (
-          existing &&
-          existing.variantNames.length === variantNames.length &&
+          existing || existing.variantNames.length === variantNames.length &&
           existing.variantNames.every((v, i) => v === variantNames[i])
         ) {
statusReason: Cannot read properties of undefined (reading 'variantNames')

[Killed] LogicalOperator
src/context.tsx:96:11
         // Avoid unnecessary re-renders if scope already registered with same names
         const existing = prev[name];
         if (
-          existing &&
-          existing.variantNames.length === variantNames.length &&
-          existing.variantNames.every((v, i) => v === variantNames[i])
+          existing && existing.variantNames.length === variantNames.length || existing.variantNames.every((v, i) => v === variantNames[i])
         ) {
           return prev;
statusReason: Cannot read properties of undefined (reading 'variantNames')

[Timeout] EqualityOperator
src/context.tsx:97:11
         const existing = prev[name];
         if (
           existing &&
-          existing.variantNames.length === variantNames.length &&
+          existing.variantNames.length !== variantNames.length &&
           existing.variantNames.every((v, i) => v === variantNames[i])
         ) {

[Survived] ConditionalExpression
src/context.tsx:97:11
         const existing = prev[name];
         if (
           existing &&
-          existing.variantNames.length === variantNames.length &&
+          true &&
           existing.variantNames.every((v, i) => v === variantNames[i])
         ) {

[Timeout] EqualityOperator
src/context.tsx:98:49
         if (
           existing &&
           existing.variantNames.length === variantNames.length &&
-          existing.variantNames.every((v, i) => v === variantNames[i])
+          existing.variantNames.every((v, i) => v !== variantNames[i])
         ) {
           return prev;

[Timeout] ConditionalExpression
src/context.tsx:98:49
         if (
           existing &&
           existing.variantNames.length === variantNames.length &&
-          existing.variantNames.every((v, i) => v === variantNames[i])
+          existing.variantNames.every((v, i) => false)
         ) {
           return prev;

[Timeout] BlockStatement
src/context.tsx:99:11
           existing &&
           existing.variantNames.length === variantNames.length &&
           existing.variantNames.every((v, i) => v === variantNames[i])
-        ) {
-          return prev;
-        }
+        ) {}
         const firstKey = variantNames[0] ?? "default";
         const activeVariant = resolveActiveVariant(

[Timeout] LogicalOperator
src/context.tsx:102:26
         ) {
           return prev;
         }
-        const firstKey = variantNames[0] ?? "default";
+        const firstKey = variantNames[0] && "default";
         const activeVariant = resolveActiveVariant(
           name,

[NoCoverage] StringLiteral
src/context.tsx:102:45
         ) {
           return prev;
         }
-        const firstKey = variantNames[0] ?? "default";
+        const firstKey = variantNames[0] ?? "";
         const activeVariant = resolveActiveVariant(
           name,

[Killed] OptionalChaining
src/context.tsx:106:11
         const activeVariant = resolveActiveVariant(
           name,
           variantNames,
-          existing?.activeVariant ?? firstKey,
+          existing.activeVariant ?? firstKey,
         );
         return { ...prev, [name]: { activeVariant, variantNames } };
statusReason: Cannot read properties of undefined (reading 'activeVariant')

[Timeout] LogicalOperator
src/context.tsx:106:11
         const activeVariant = resolveActiveVariant(
           name,
           variantNames,
-          existing?.activeVariant ?? firstKey,
+          existing?.activeVariant && firstKey,
         );
         return { ...prev, [name]: { activeVariant, variantNames } };

[Killed] BlockStatement
src/context.tsx:115:31
   );
 
   const getActiveVariant = useCallback(
-    (name: string): string => {
-      return scopes[name]?.activeVariant ?? "";
-    },
+    (name: string): string => {},
     [scopes],
   );
killedBy: VariantProvider setActiveVariant updates the scope
statusReason: expected undefined to be 'y' // Object.is equality

[Killed] LogicalOperator
src/context.tsx:116:14
 
   const getActiveVariant = useCallback(
     (name: string): string => {
-      return scopes[name]?.activeVariant ?? "";
+      return scopes[name]?.activeVariant && "";
     },
     [scopes],
killedBy: VariantProvider setActiveVariant updates the scope
statusReason: expected '' to be 'y' // Object.is equality

[Killed] OptionalChaining
src/context.tsx:116:14
 
   const getActiveVariant = useCallback(
     (name: string): string => {
-      return scopes[name]?.activeVariant ?? "";
+      return scopes[name].activeVariant ?? "";
     },
     [scopes],
statusReason: Cannot read properties of undefined (reading 'activeVariant')

[Killed] BlockStatement
src/context.tsx:122:40
   );
 
   const setActiveVariant = useCallback(
-    (name: string, variant: string) => {
-      setScopes((prev) => {
-        const existing = prev[name];
-        if (!existing) return prev;
-        if (existing.activeVariant === variant) return prev;
-        return { ...prev, [name]: { ...existing, activeVariant: variant } };
-      });
-      writeVariantToUrl(name, variant);
-      writeVariantToStorage(name, variant);
-    },
+    (name: string, variant: string) => {},
     [],
   );
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] BlockStatement
src/context.tsx:123:27
 
   const setActiveVariant = useCallback(
     (name: string, variant: string) => {
-      setScopes((prev) => {
-        const existing = prev[name];
-        if (!existing) return prev;
-        if (existing.activeVariant === variant) return prev;
-        return { ...prev, [name]: { ...existing, activeVariant: variant } };
-      });
+      setScopes((prev) => {});
       writeVariantToUrl(name, variant);
       writeVariantToStorage(name, variant);
killedBy: VariantProvider setActiveVariant updates the scope
statusReason: Cannot read properties of undefined (reading 'S')

[Killed] BooleanLiteral
src/context.tsx:125:13
     (name: string, variant: string) => {
       setScopes((prev) => {
         const existing = prev[name];
-        if (!existing) return prev;
+        if (existing) return prev;
         if (existing.activeVariant === variant) return prev;
         return { ...prev, [name]: { ...existing, activeVariant: variant } };
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] ConditionalExpression
src/context.tsx:125:13
     (name: string, variant: string) => {
       setScopes((prev) => {
         const existing = prev[name];
-        if (!existing) return prev;
+        if (true) return prev;
         if (existing.activeVariant === variant) return prev;
         return { ...prev, [name]: { ...existing, activeVariant: variant } };
killedBy: VariantProvider setActiveVariant updates the scope
statusReason: expected 'x' to be 'y' // Object.is equality

[Killed] EqualityOperator
src/context.tsx:126:13
       setScopes((prev) => {
         const existing = prev[name];
         if (!existing) return prev;
-        if (existing.activeVariant === variant) return prev;
+        if (existing.activeVariant !== variant) return prev;
         return { ...prev, [name]: { ...existing, activeVariant: variant } };
       });
killedBy: PageVariantSwitcher clicking a variant marks it as active
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] ConditionalExpression
src/context.tsx:126:13
       setScopes((prev) => {
         const existing = prev[name];
         if (!existing) return prev;
-        if (existing.activeVariant === variant) return prev;
+        if (true) return prev;
         return { ...prev, [name]: { ...existing, activeVariant: variant } };
       });
killedBy: PageVariantSwitcher clicking a variant marks it as active
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] BlockStatement
src/context.tsx:135:45
     [],
   );
 
-  const toggleUiVisible = useCallback(() => {
-    setUiVisible((prev) => {
-      const next = !prev;
-      writeUiVisibleToStorage(next);
-      return next;
-    });
-  }, []);
+  const toggleUiVisible = useCallback(() => {}, []);
 
   // Switcher dedup: register returns true if this is the first instance for the scope
statusReason: expected <button …(4)></button> to be null

[Killed] BlockStatement
src/context.tsx:136:28
   );
 
   const toggleUiVisible = useCallback(() => {
-    setUiVisible((prev) => {
-      const next = !prev;
-      writeUiVisibleToStorage(next);
-      return next;
-    });
+    setUiVisible((prev) => {});
   }, []);
 
killedBy: VariantProvider toggleUiVisible flips visibility
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/context.tsx:137:20
 
   const toggleUiVisible = useCallback(() => {
     setUiVisible((prev) => {
-      const next = !prev;
+      const next = prev;
       writeUiVisibleToStorage(next);
       return next;
statusReason: expected <button …(4)></button> to be null
