[Killed] BlockStatement
src/registry.ts:25:76
  *   detailed: { showMeta: true },
  * })
  */
-export function registerVariant(name: string, variants: VariantDefs): void {
-  registry.set(name, variants);
-}
+export function registerVariant(name: string, variants: VariantDefs): void {}
 
 /**
killedBy: registry registerVariant registers a variant definition
statusReason: expected undefined to deeply equal { default: {}, minimal: { …(1) } }

[Killed] BlockStatement
src/registry.ts:33:77
  * Retrieve previously registered variant definitions for a scope.
  * Returns undefined if the scope was never registered.
  */
-export function getRegisteredVariant(name: string): VariantDefs | undefined {
-  return registry.get(name);
-}
+export function getRegisteredVariant(name: string): VariantDefs | undefined {}
 
 /** Clear all registrations. Primarily used in tests. */
killedBy: registry registerVariant registers a variant definition
statusReason: expected undefined to deeply equal { default: {}, minimal: { …(1) } }

[Killed] BlockStatement
src/registry.ts:38:46
 }
 
 /** Clear all registrations. Primarily used in tests. */
-export function clearVariantRegistry(): void {
-  registry.clear();
-}
+export function clearVariantRegistry(): void {}
 
killedBy: registry clearVariantRegistry removes all registered variants
statusReason: expected { default: {} } to be undefined
