[Killed] StringLiteral
src/useKeyboardShortcuts.ts:69:29
       }
     };
 
-    window.addEventListener("keydown", handler);
+    window.addEventListener("", handler);
     return () => window.removeEventListener("keydown", handler);
   }, [onToggleUi, shortcuts]);
statusReason: expected true to be false // Object.is equality

[Timeout] ArrowFunction
src/useKeyboardShortcuts.ts:70:12
     };
 
     window.addEventListener("keydown", handler);
-    return () => window.removeEventListener("keydown", handler);
+    return () => undefined;
   }, [onToggleUi, shortcuts]);
 }

[Timeout] StringLiteral
src/useKeyboardShortcuts.ts:70:45
     };
 
     window.addEventListener("keydown", handler);
-    return () => window.removeEventListener("keydown", handler);
+    return () => window.removeEventListener("", handler);
   }, [onToggleUi, shortcuts]);
 }
