[Killed] BlockStatement
src/useVariant.ts:37:40
   const ctx = useVariantContext();
 
   // Merge registered variants with inline variants; inline wins.
-  const mergedVariants = useMemo(() => {
-    const registered = getRegisteredVariant(name);
-    return registered ? { ...registered, ...variants } : variants;
-  }, [name, variants]);
+  const mergedVariants = useMemo(() => {}, [name, variants]);
 
   const variantKeys = useMemo(
killedBy: useVariant returns the first variant (default) when nothing stored
statusReason: Cannot convert undefined or null to object

[Killed] ObjectLiteral
src/useVariant.ts:39:25
   // Merge registered variants with inline variants; inline wins.
   const mergedVariants = useMemo(() => {
     const registered = getRegisteredVariant(name);
-    return registered ? { ...registered, ...variants } : variants;
+    return registered ? {} : variants;
   }, [name, variants]);
 
killedBy: useVariant merges registered variants with inline variants (registry base key preserved, inline wins on conflict)
statusReason: expected [] to include 'base'

[Killed] ArrowFunction
src/useVariant.ts:43:5
   }, [name, variants]);
 
   const variantKeys = useMemo(
-    () => Object.keys(mergedVariants),
+    () => undefined,
     [mergedVariants],
   );
killedBy: useVariant returns the first variant (default) when nothing stored
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/useVariant.ts:48:19
   );
 
   // Register (or re-register) the scope when variant keys change
-  useEffect(() => {
-    ctx.registerScope(name, variantKeys);
-  }, [ctx, name, variantKeys]);
+  useEffect(() => {}, [ctx, name, variantKeys]);
 
   // Resolve the active variant (URL → localStorage → first key)
killedBy: useVariant registers the scope with the provider on mount
statusReason: expected undefined to be defined

[Survived] ArrayDeclaration
src/useVariant.ts:50:6
   // Register (or re-register) the scope when variant keys change
   useEffect(() => {
     ctx.registerScope(name, variantKeys);
-  }, [ctx, name, variantKeys]);
+  }, []);
 
   // Resolve the active variant (URL → localStorage → first key)
