[Killed] BlockStatement
src/utils.ts:18:52
 // ---------------------------------------------------------------------------
 
 /** Encode a scope name for use as a URL query param key: "vf[ScopeName]" */
-export function encodeUrlKey(name: string): string {
-  return `${URL_PARAM_PREFIX}[${name}]`;
-}
+export function encodeUrlKey(name: string): string {}
 
 /** Read the active variant for a scope from the current URL search params. */
killedBy: PageVariantSwitcher uses URL variant as initial active (priority over localStorage)
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] BlockStatement
src/utils.ts:23:65
 }
 
 /** Read the active variant for a scope from the current URL search params. */
-export function readVariantFromUrl(name: string): string | null {
-  if (typeof window === "undefined") return null;
-  const params = new URLSearchParams(window.location.search);
-  return params.get(encodeUrlKey(name));
-}
+export function readVariantFromUrl(name: string): string | null {}
 
 /** Write the active variant for a scope into the URL (pushState — no reload). */
killedBy: PageVariantSwitcher uses URL variant as initial active (priority over localStorage)
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] EqualityOperator
src/utils.ts:24:7
 
 /** Read the active variant for a scope from the current URL search params. */
 export function readVariantFromUrl(name: string): string | null {
-  if (typeof window === "undefined") return null;
+  if (typeof window !== "undefined") return null;
   const params = new URLSearchParams(window.location.search);
   return params.get(encodeUrlKey(name));
killedBy: PageVariantSwitcher uses URL variant as initial active (priority over localStorage)
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] ConditionalExpression
src/utils.ts:24:7
 
 /** Read the active variant for a scope from the current URL search params. */
 export function readVariantFromUrl(name: string): string | null {
-  if (typeof window === "undefined") return null;
+  if (true) return null;
   const params = new URLSearchParams(window.location.search);
   return params.get(encodeUrlKey(name));
killedBy: PageVariantSwitcher uses URL variant as initial active (priority over localStorage)
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Timeout] BlockStatement
src/utils.ts:30:72
 }
 
 /** Write the active variant for a scope into the URL (pushState — no reload). */
-export function writeVariantToUrl(name: string, variant: string): void {
-  if (typeof window === "undefined") return;
-  const params = new URLSearchParams(window.location.search);
-  params.set(encodeUrlKey(name), variant);
-  const newSearch = params.toString();
-  const newUrl = `${window.location.pathname}?${newSearch}${window.location.hash}`;
-  window.history.pushState(null, "", newUrl);
-}
+export function writeVariantToUrl(name: string, variant: string): void {}
 
 /** Remove a scope's variant from the URL. */

[Timeout] ConditionalExpression
src/utils.ts:31:7
 
 /** Write the active variant for a scope into the URL (pushState — no reload). */
 export function writeVariantToUrl(name: string, variant: string): void {
-  if (typeof window === "undefined") return;
+  if (false) return;
   const params = new URLSearchParams(window.location.search);
   params.set(encodeUrlKey(name), variant);

[Timeout] EqualityOperator
src/utils.ts:31:7
 
 /** Write the active variant for a scope into the URL (pushState — no reload). */
 export function writeVariantToUrl(name: string, variant: string): void {
-  if (typeof window === "undefined") return;
+  if (typeof window !== "undefined") return;
   const params = new URLSearchParams(window.location.search);
   params.set(encodeUrlKey(name), variant);

[Killed] BlockStatement
src/utils.ts:40:58
 }
 
 /** Remove a scope's variant from the URL. */
-export function removeVariantFromUrl(name: string): void {
-  if (typeof window === "undefined") return;
-  const params = new URLSearchParams(window.location.search);
-  params.delete(encodeUrlKey(name));
-  const newSearch = params.toString();
-  const newUrl =
-    newSearch
-      ? `${window.location.pathname}?${newSearch}${window.location.hash}`
-      : `${window.location.pathname}${window.location.hash}`;
-  window.history.pushState(null, "", newUrl);
-}
+export function removeVariantFromUrl(name: string): void {}
 
 // ---------------------------------------------------------------------------
killedBy: writeVariantToUrl / removeVariantFromUrl removeVariantFromUrl calls pushState without the param
statusReason: expected "pushState" to be called once, but got 0 times

[Killed] EqualityOperator
src/utils.ts:41:7
 
 /** Remove a scope's variant from the URL. */
 export function removeVariantFromUrl(name: string): void {
-  if (typeof window === "undefined") return;
+  if (typeof window !== "undefined") return;
   const params = new URLSearchParams(window.location.search);
   params.delete(encodeUrlKey(name));
killedBy: writeVariantToUrl / removeVariantFromUrl removeVariantFromUrl calls pushState without the param
statusReason: expected "pushState" to be called once, but got 0 times

[Killed] ConditionalExpression
src/utils.ts:41:7
 
 /** Remove a scope's variant from the URL. */
 export function removeVariantFromUrl(name: string): void {
-  if (typeof window === "undefined") return;
+  if (true) return;
   const params = new URLSearchParams(window.location.search);
   params.delete(encodeUrlKey(name));
killedBy: writeVariantToUrl / removeVariantFromUrl removeVariantFromUrl calls pushState without the param
statusReason: expected "pushState" to be called once, but got 0 times

[Killed] BlockStatement
src/utils.ts:56:38
 // localStorage helpers
 // ---------------------------------------------------------------------------
 
-function lsKey(name: string): string {
-  return `${LS_PREFIX}${name}`;
-}
+function lsKey(name: string): string {}
 
 /** Read the active variant for a scope from localStorage. */
killedBy: PageVariantSwitcher uses localStorage variant as initial active
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] BlockStatement
src/utils.ts:61:69
 }
 
 /** Read the active variant for a scope from localStorage. */
-export function readVariantFromStorage(name: string): string | null {
-  if (typeof window === "undefined") return null;
-  try {
-    return window.localStorage.getItem(lsKey(name));
-  } catch {
-    return null;
-  }
-}
+export function readVariantFromStorage(name: string): string | null {}
 
 /** Write the active variant for a scope to localStorage. */
killedBy: PageVariantSwitcher uses localStorage variant as initial active
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] EqualityOperator
src/utils.ts:62:7
 
 /** Read the active variant for a scope from localStorage. */
 export function readVariantFromStorage(name: string): string | null {
-  if (typeof window === "undefined") return null;
+  if (typeof window !== "undefined") return null;
   try {
     return window.localStorage.getItem(lsKey(name));
killedBy: PageVariantSwitcher uses localStorage variant as initial active
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] ConditionalExpression
src/utils.ts:62:7
 
 /** Read the active variant for a scope from localStorage. */
 export function readVariantFromStorage(name: string): string | null {
-  if (typeof window === "undefined") return null;
+  if (true) return null;
   try {
     return window.localStorage.getItem(lsKey(name));
killedBy: PageVariantSwitcher uses localStorage variant as initial active
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] BlockStatement
src/utils.ts:63:7
 /** Read the active variant for a scope from localStorage. */
 export function readVariantFromStorage(name: string): string | null {
   if (typeof window === "undefined") return null;
-  try {
-    return window.localStorage.getItem(lsKey(name));
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: PageVariantSwitcher uses localStorage variant as initial active
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[NoCoverage] BlockStatement
src/utils.ts:65:11
   if (typeof window === "undefined") return null;
   try {
     return window.localStorage.getItem(lsKey(name));
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[Timeout] BlockStatement
src/utils.ts:71:76
 }
 
 /** Write the active variant for a scope to localStorage. */
-export function writeVariantToStorage(name: string, variant: string): void {
-  if (typeof window === "undefined") return;
-  try {
-    window.localStorage.setItem(lsKey(name), variant);
-  } catch {
-    // Silently ignore (private browsing, storage quota, etc.)
-  }
-}
+export function writeVariantToStorage(name: string, variant: string): void {}
 
 /** Remove a scope's variant from localStorage. */

[Timeout] ConditionalExpression
src/utils.ts:72:7
 
 /** Write the active variant for a scope to localStorage. */
 export function writeVariantToStorage(name: string, variant: string): void {
-  if (typeof window === "undefined") return;
+  if (false) return;
   try {
     window.localStorage.setItem(lsKey(name), variant);

[Timeout] EqualityOperator
src/utils.ts:72:7
 
 /** Write the active variant for a scope to localStorage. */
 export function writeVariantToStorage(name: string, variant: string): void {
-  if (typeof window === "undefined") return;
+  if (typeof window !== "undefined") return;
   try {
     window.localStorage.setItem(lsKey(name), variant);

[Timeout] BlockStatement
src/utils.ts:73:7
 /** Write the active variant for a scope to localStorage. */
 export function writeVariantToStorage(name: string, variant: string): void {
   if (typeof window === "undefined") return;
-  try {
-    window.localStorage.setItem(lsKey(name), variant);
-  } catch {
+  try {} catch {
     // Silently ignore (private browsing, storage quota, etc.)
   }

[Killed] BlockStatement
src/utils.ts:81:62
 }
 
 /** Remove a scope's variant from localStorage. */
-export function removeVariantFromStorage(name: string): void {
-  if (typeof window === "undefined") return;
-  try {
-    window.localStorage.removeItem(lsKey(name));
-  } catch {
-    // Silently ignore
-  }
-}
+export function removeVariantFromStorage(name: string): void {}
 
 // ---------------------------------------------------------------------------
killedBy: localStorage helpers removeVariantFromStorage clears the key
statusReason: expected 'swimlane' to be null

[Killed] ConditionalExpression
src/utils.ts:82:7
 
 /** Remove a scope's variant from localStorage. */
 export function removeVariantFromStorage(name: string): void {
-  if (typeof window === "undefined") return;
+  if (true) return;
   try {
     window.localStorage.removeItem(lsKey(name));
killedBy: localStorage helpers removeVariantFromStorage clears the key
statusReason: expected 'swimlane' to be null

[Killed] EqualityOperator
src/utils.ts:82:7
 
 /** Remove a scope's variant from localStorage. */
 export function removeVariantFromStorage(name: string): void {
-  if (typeof window === "undefined") return;
+  if (typeof window !== "undefined") return;
   try {
     window.localStorage.removeItem(lsKey(name));
killedBy: localStorage helpers removeVariantFromStorage clears the key
statusReason: expected 'swimlane' to be null

[Killed] BlockStatement
src/utils.ts:83:7
 /** Remove a scope's variant from localStorage. */
 export function removeVariantFromStorage(name: string): void {
   if (typeof window === "undefined") return;
-  try {
-    window.localStorage.removeItem(lsKey(name));
-  } catch {
+  try {} catch {
     // Silently ignore
   }
killedBy: localStorage helpers removeVariantFromStorage clears the key
statusReason: expected 'swimlane' to be null

[Killed] BlockStatement
src/utils.ts:97:65
 const UI_VISIBLE_KEY = "__vf__ui_visible__";
 
 /** Persist the UI visibility flag. */
-export function writeUiVisibleToStorage(visible: boolean): void {
-  if (typeof window === "undefined") return;
-  try {
-    window.localStorage.setItem(UI_VISIBLE_KEY, String(visible));
-  } catch {
-    // Silently ignore
-  }
-}
+export function writeUiVisibleToStorage(visible: boolean): void {}
 
 /** Read the persisted UI visibility flag. Returns null when not set. */
killedBy: UI visible storage persists true
statusReason: expected null to be true // Object.is equality

[Killed] EqualityOperator
src/utils.ts:98:7
 
 /** Persist the UI visibility flag. */
 export function writeUiVisibleToStorage(visible: boolean): void {
-  if (typeof window === "undefined") return;
+  if (typeof window !== "undefined") return;
   try {
     window.localStorage.setItem(UI_VISIBLE_KEY, String(visible));
killedBy: UI visible storage persists true
statusReason: expected null to be true // Object.is equality

[Killed] ConditionalExpression
src/utils.ts:98:7
 
 /** Persist the UI visibility flag. */
 export function writeUiVisibleToStorage(visible: boolean): void {
-  if (typeof window === "undefined") return;
+  if (true) return;
   try {
     window.localStorage.setItem(UI_VISIBLE_KEY, String(visible));
killedBy: UI visible storage persists true
statusReason: expected null to be true // Object.is equality

[Killed] BlockStatement
src/utils.ts:99:7
 /** Persist the UI visibility flag. */
 export function writeUiVisibleToStorage(visible: boolean): void {
   if (typeof window === "undefined") return;
-  try {
-    window.localStorage.setItem(UI_VISIBLE_KEY, String(visible));
-  } catch {
+  try {} catch {
     // Silently ignore
   }
killedBy: UI visible storage persists true
statusReason: expected null to be true // Object.is equality

[Killed] BlockStatement
src/utils.ts:107:60
 }
 
 /** Read the persisted UI visibility flag. Returns null when not set. */
-export function readUiVisibleFromStorage(): boolean | null {
-  if (typeof window === "undefined") return null;
-  try {
-    const val = window.localStorage.getItem(UI_VISIBLE_KEY);
-    if (val === null) return null;
-    return val !== "false";
-  } catch {
-    return null;
-  }
-}
+export function readUiVisibleFromStorage(): boolean | null {}
 
 // ---------------------------------------------------------------------------
killedBy: PageVariantSwitcher renders the toolbar with variant buttons
statusReason: Unable to find an accessible element with the role "toolbar" and name `/Layout/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/utils.ts:108:7
 
 /** Read the persisted UI visibility flag. Returns null when not set. */
 export function readUiVisibleFromStorage(): boolean | null {
-  if (typeof window === "undefined") return null;
+  if (true) return null;
   try {
     const val = window.localStorage.getItem(UI_VISIBLE_KEY);
killedBy: UI visible storage persists true
statusReason: expected null to be true // Object.is equality

[Killed] EqualityOperator
src/utils.ts:108:7
 
 /** Read the persisted UI visibility flag. Returns null when not set. */
 export function readUiVisibleFromStorage(): boolean | null {
-  if (typeof window === "undefined") return null;
+  if (typeof window !== "undefined") return null;
   try {
     const val = window.localStorage.getItem(UI_VISIBLE_KEY);
killedBy: VariantProvider reads persisted uiVisible from localStorage
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils.ts:109:7
 /** Read the persisted UI visibility flag. Returns null when not set. */
 export function readUiVisibleFromStorage(): boolean | null {
   if (typeof window === "undefined") return null;
-  try {
-    const val = window.localStorage.getItem(UI_VISIBLE_KEY);
-    if (val === null) return null;
-    return val !== "false";
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: PageVariantSwitcher renders the toolbar with variant buttons
statusReason: Unable to find an accessible element with the role "toolbar" and name `/Layout/`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] EqualityOperator
src/utils.ts:111:9
   if (typeof window === "undefined") return null;
   try {
     const val = window.localStorage.getItem(UI_VISIBLE_KEY);
-    if (val === null) return null;
+    if (val !== null) return null;
     return val !== "false";
   } catch {
killedBy: PageVariantSwitcher is hidden when uiVisible is false
statusReason: expected <div role="toolbar" …(2)>…(3)</div> to be null

[Killed] ConditionalExpression
src/utils.ts:111:9
   if (typeof window === "undefined") return null;
   try {
     const val = window.localStorage.getItem(UI_VISIBLE_KEY);
-    if (val === null) return null;
+    if (true) return null;
     return val !== "false";
   } catch {
killedBy: UI visible storage persists true
statusReason: expected null to be true // Object.is equality

[Killed] EqualityOperator
src/utils.ts:112:12
   try {
     const val = window.localStorage.getItem(UI_VISIBLE_KEY);
     if (val === null) return null;
-    return val !== "false";
+    return val === "false";
   } catch {
     return null;
killedBy: UI visible storage persists true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils.ts:112:12
   try {
     const val = window.localStorage.getItem(UI_VISIBLE_KEY);
     if (val === null) return null;
-    return val !== "false";
+    return true;
   } catch {
     return null;
killedBy: VariantProvider reads persisted uiVisible from localStorage
statusReason: expected true to be false // Object.is equality

[NoCoverage] BlockStatement
src/utils.ts:113:11
     const val = window.localStorage.getItem(UI_VISIBLE_KEY);
     if (val === null) return null;
     return val !== "false";
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/utils.ts:130:11
   name: string,
   variantKeys: string[],
   defaultKey: string,
-): string {
-  const fromUrl = readVariantFromUrl(name);
-  if (fromUrl && variantKeys.includes(fromUrl)) return fromUrl;
-
-  const fromStorage = readVariantFromStorage(name);
-  if (fromStorage && variantKeys.includes(fromStorage)) return fromStorage;
-
-  return defaultKey;
-}
+): string {}
 
killedBy: PageVariantSwitcher first variant is active by default
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] ConditionalExpression
src/utils.ts:132:7
   defaultKey: string,
 ): string {
   const fromUrl = readVariantFromUrl(name);
-  if (fromUrl && variantKeys.includes(fromUrl)) return fromUrl;
+  if (true) return fromUrl;
 
   const fromStorage = readVariantFromStorage(name);
killedBy: PageVariantSwitcher first variant is active by default
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"

[Killed] LogicalOperator
src/utils.ts:132:7
   defaultKey: string,
 ): string {
   const fromUrl = readVariantFromUrl(name);
-  if (fromUrl && variantKeys.includes(fromUrl)) return fromUrl;
+  if (fromUrl || variantKeys.includes(fromUrl)) return fromUrl;
 
   const fromStorage = readVariantFromStorage(name);
killedBy: resolveActiveVariant ignores URL value that is not in variantKeys
statusReason: expected 'nonexistent' to be 'default' // Object.is equality

[Killed] ConditionalExpression
src/utils.ts:135:7
   if (fromUrl && variantKeys.includes(fromUrl)) return fromUrl;
 
   const fromStorage = readVariantFromStorage(name);
-  if (fromStorage && variantKeys.includes(fromStorage)) return fromStorage;
+  if (true) return fromStorage;
 
   return defaultKey;
killedBy: resolveActiveVariant returns default key when nothing set
statusReason: expected null to be 'default' // Object.is equality

[Killed] ConditionalExpression
src/utils.ts:135:7
   if (fromUrl && variantKeys.includes(fromUrl)) return fromUrl;
 
   const fromStorage = readVariantFromStorage(name);
-  if (fromStorage && variantKeys.includes(fromStorage)) return fromStorage;
+  if (false) return fromStorage;
 
   return defaultKey;
killedBy: PageVariantSwitcher uses localStorage variant as initial active
statusReason: expect(element).toHaveAttribute("aria-checked", "true") // element.getAttribute("aria-checked") === "true"

Expected the element to have attribute:
  aria-checked="true"
Received:
  aria-checked="false"
